{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hello there!",
                "Hi!",
                "Hey!",
                "Good morning!",
                "Good afternoon!",
                "Good evening!",
                "Hi there, chatbot!",
                "Hey, how are you?",
                "Greetings, chatbot!",
                "What's up, bot?",
                "Hi, buddy!",
                "Hello, dear bot!",
                "Howdy, chatbot!",
                "Yo, bot!",
                "Hey, chat friend!",
                "Hi, virtual assistant!",
                "Hello, AI bot!",
                "Hi, there, clever bot!",
                "Greetings and salutations!",
                "Well, hello there!",
                "Hiya, chatbot!",
                "Good to see you, bot!",
                "Hey, robot friend!",
                "How's it going, chatbot?",
                "Hello, smart AI!",
                "Hi there, helpful bot!",
                "Hey, virtual friend!",
                "Hello, chat partner!",
                "How are you doing today?",
                "Hi, interactive assistant!",
                "Greetings, helpful bot!",
                "Hey, AI buddy!",
                "Hi there, digital companion!",
                "Hello, knowledgeable bot!",
                "Good morning, chatbot friend!",
                "Hey, smart bot, how can you assist me?",
                "Hi, bot, ready to chat?",
                "Hello, friendly AI!",
                "Hi there, chatbot expert!",
                "Hey, virtual buddy!",
                "Hello, clever chatbot!",
                "How's my favorite AI today?",
                "Hi there, amazing bot!",
                "Hey, chatbot, nice to see you!",
                "Hello, intelligent assistant!",
                "Hi, there, chatbot pal!",
                "Hey, helpful virtual friend!",
                "Greetings, virtual chat assistant!",
                "Well, hello, chatbot genius!",
                "Hi, talkative bot!"
            ],
            "responses": [
                "Hey there! I hope you have a great day ahead. How can I assist you? You can ask.\n",
                "Hello! Wishing you a wonderful day. How may I be of service? You can ask.\n",
                "Greetings! I hope your day is going well. How can I help you today? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. What can I do for you? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I be of assistance? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How may I assist you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How can I help you today? You can ask.\n",
                "Hey there! I hope you're having a great day. How may I be of service? You can ask.\n",
                "Hello! Wishing you a wonderful day ahead. What can I do for you? You can ask.\n",
                "Greetings! I hope your day is going well. How can I assist you today? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I help you today? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How may I assist you? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How can I be of assistance? You can ask.\n",
                "Hi! Wishing you a fantastic day. What can I do for you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. What can I do for you? You can ask.\n",
                "Hello! Wishing you a wonderful day. How can I assist you? You can ask.\n",
                "Greetings! I hope your day is going well. How may I help you? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How may I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I be of service? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. What can I do for you? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How can I assist you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How may I help you? You can ask.\n",
                "Hey there! I hope you're having a great day. What can I do for you? You can ask.\n",
                "Hello! Wishing you a wonderful day ahead. How can I be of assistance? You can ask.\n",
                "Greetings! I hope your day is going well. How can I help you today? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How may I assist you? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I help you today? You can ask.\n",
                "Greetings! I hope your day is filled with joy. What can I do for you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How can I assist you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. What can I do for you? You can ask.\n",
                "Hello! Wishing you a wonderful day. How may I be of service? You can ask.\n",
                "Greetings! I hope your day is going well. How can I assist you? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I be of service? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I help you today? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How can I assist you? You can ask.\n",
                "Hi! Wishing you a fantastic day. What can I do for you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. How may I be of service? You can ask.\n",
                "Hello! Wishing you a wonderful day. How can I assist you? You can ask.\n",
                "Greetings! I hope your day is going well. What can I do for you? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I help you today? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I assist you? You can ask.\n",
                "Greetings! I hope your day is filled with joy. What can I do for you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How can I assist you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. How can I be of service? You can ask.\n",
                "Hello! Wishing you a wonderful day. How can I assist you?"
            ]
        },
        {
            "tag": "book_session",
            "patterns": [
                "Could you help me schedule an appointment with one of your doctors?",
                "I'm interested in booking a session with one of your doctors, can you assist?",
                "Please, I need to make an appointment to see one of your doctors.",
                "I'd appreciate it if you could help me arrange a consultation with one of your doctors.",
                "I want to book an appointment with one of your doctors, can you guide me through the process?",
                "Can you assist me in scheduling a doctor's appointment at your facility?",
                "I'm looking to reserve a slot with one of your doctors, can you provide available dates?",
                "Could you please help me book a session with one of your doctors?",
                "I need your assistance in setting up an appointment with one of your doctors.",
                "Can you guide me on how to make an appointment with one of your doctors?",
                "I'd like to schedule a consultation with one of your doctors, can you help?",
                "Please assist me in reserving a session with one of your doctors.",
                "I'm hoping you can help me arrange a doctor's appointment at your hospital.",
                "Is it possible to book an appointment with one of your doctors? I'd appreciate your help.",
                "I'm interested in seeing one of your doctors, can you provide me with the next available slot?",
                "Could you please arrange a consultation with one of your doctors for me?",
                "I'd like to make an appointment with a doctor from your medical team.",
                "Can you help me schedule a session with one of your doctors, please?",
                "I need to set up a meeting with one of your doctors. Can you assist me?",
                "I'm looking to book a session with one of your doctors, can you tell me how to proceed?",
                "Please, I need to make an appointment with one of your doctors as soon as possible.",
                "Could you assist me in reserving a slot with one of your doctors?",
                "I want to book a consultation with one of your doctors, please guide me.",
                "Is it possible to schedule a doctor's appointment at your hospital?",
                "I'm interested in arranging a consultation with one of your doctors, can you help?",
                "Can you guide me on how to book a session with one of your doctors?",
                "I'd appreciate your help in setting up an appointment with one of your doctors.",
                "I'm hoping you can assist me in scheduling a doctor's appointment.",
                "Please, I need to reserve a session with one of your doctors.",
                "I want to make an appointment with one of your doctors, can you provide the necessary details?",
                "Could you please help me arrange a consultation with one of your doctors?",
                "I'm interested in seeing a doctor from your medical staff, can you assist?",
                "Can you guide me on how to make an appointment with one of your doctors?",
                "I'd like to schedule a session with one of your doctors, please help me.",
                "Please assist me in reserving a slot with one of your doctors.",
                "I'm hoping you can help me book an appointment with one of your doctors.",
                "Is it possible to book a session with one of your doctors? Your assistance is appreciated.",
                "I'm interested in seeing one of your doctors, can you tell me the next available date?",
                "Could you please arrange a consultation with one of your doctors for me?",
                "I want to make an appointment with a doctor from your medical team.",
                "Can you help me schedule a session with one of your doctors, please?",
                "I need to set up a meeting with one of your doctors, your help is valued.",
                "I'm looking to book a session with one of your doctors, can you guide me?",
                "Please, I need to make an appointment with one of your doctors soon.",
                "Could you assist me in reserving a slot with one of your doctors?",
                "I want to book a consultation with one of your doctors, your guidance is essential.",
                "Is it possible to schedule a doctor's appointment at your hospital?",
                "I'm interested in arranging a consultation with one of your doctors, can you assist me?",
                "Can you guide me on how to book a session with one of your doctors?",
                "I'd appreciate your help in setting up an appointment with one of your doctors."
            ],
            "responses": [
                "I'm here to help. Could you kindly describe the symptoms you're currently facing?",
                "Sure thing! Please let me know what symptoms you're experiencing so I can better understand and assist you.",
                "No problem at all. Can you share the symptoms you're dealing with so I can offer appropriate support?",
                "I'm ready to assist. Please provide details about the symptoms you're going through.",
                "Of course, I'm here to listen. What symptoms have you been experiencing lately?",
                "I'm here to help with your symptoms. Could you let me know what you're going through?",
                "Sure, I'm all ears. Tell me about the symptoms you're currently encountering.",
                "I'm here to support you. Please share the symptoms you've been dealing with.",
                "I'm here to assist with your health concerns. What symptoms are you experiencing?",
                "No worries, I'm here to listen. What symptoms would you like to discuss?",
                "I'm ready to help. Please tell me about the symptoms you're facing.",
                "Of course, I'm here to assist you. What symptoms are you currently dealing with?",
                "Sure, I'm here to lend a hand. Could you describe the symptoms you've been having?",
                "I'm here to assist with any health issues you may have. What symptoms are troubling you?",
                "No problem, I'm here to help. Can you let me know what symptoms you're experiencing?",
                "I'm ready to listen and offer support. Please describe the symptoms you're going through.",
                "Of course, I'm here to assist you with your symptoms. What are they?",
                "Sure thing! Please share the symptoms you've been experiencing so I can better understand.",
                "I'm here to support you. Can you tell me about the symptoms you're currently facing?",
                "I'm all ears. What symptoms are you dealing with that I can help you with?",
                "No worries, I'm here to assist. What symptoms have you been experiencing lately?",
                "I'm here to help with your symptoms. Let me know what you're going through.",
                "I'm here to listen and provide guidance. Please share the symptoms you've been having.",
                "Sure, I'm here to lend a hand. What symptoms are troubling you that you'd like to discuss?",
                "I'm here to assist with any health concerns. Could you describe the symptoms you're facing?",
                "No problem, I'm here to help. What symptoms would you like to talk about?",
                "I'm ready to help. Please let me know about the symptoms you're dealing with.",
                "Of course, I'm here to assist you. Can you tell me about the symptoms you're experiencing?",
                "Sure, I'm here to listen and offer support. Please describe your symptoms.",
                "I'm here to support you. What symptoms have you been experiencing that I should know about?",
                "I'm here to help. Could you kindly share the symptoms you're currently experiencing?",
                "Of course, I'm here to assist you. Please let me know what symptoms you're going through.",
                "No problem at all. Can you describe the symptoms you're dealing with so I can offer help?",
                "I'm ready to assist. Please provide details about the symptoms you're facing.",
                "Of course, I'm here to listen. What symptoms are you currently encountering?",
                "Sure, I'm all ears. Tell me about the symptoms you're currently dealing with.",
                "I'm here to assist with your health concerns. What symptoms are you experiencing?",
                "No worries, I'm here to listen. What symptoms would you like to discuss?",
                "I'm ready to help. Please tell me about the symptoms you're facing.",
                "Of course, I'm here to assist with your symptoms. What are they?",
                "Sure thing! Please share the symptoms you've been experiencing so I can better understand.",
                "I'm here to support you. Can you tell me about the symptoms you're currently facing?",
                "I'm all ears. What symptoms are you dealing with that I can help you with?",
                "No worries, I'm here to assist. What symptoms have you been experiencing lately?",
                "I'm here to help with your symptoms. Let me know what you're going through.",
                "I'm here to listen and provide guidance. Please share the symptoms you've been having.",
                "Sure, I'm here to lend a hand. What symptoms are troubling you that you'd like to discuss?",
                "I'm here to assist with any health concerns. Could you describe the symptoms you're facing?",
                "No problem, I'm here to help. What symptoms would you like to talk about?",
                "I'm ready to help. Please let me know about the symptoms you're dealing with."
            ]
        },
        {
            "tag": "symptoms",
            "patterns": [
                "I've had a fever, sore throat, and body aches for the past few days.",
                "I've been feeling fatigued and weak, and I've lost my appetite.",
                "I've had a persistent cough and congestion, and my energy levels are lower than usual.",
                "I've been experiencing sharp chest pain that radiates to my left arm.",
                "I feel a pounding sensation in my chest and it's accompanied by shortness of breath.",
                "I've had sudden episodes of dizziness and fainting.",
                "I've been experiencing persistent stomach pain and discomfort, especially after eating.",
                "I've noticed changes in my bowel habits, including diarrhea and constipation.",
                "I often feel bloated and have frequent indigestion, even with smaller meals.",
                "I've developed a persistent rash on my skin that is red, itchy, and has spread to different areas.",
                "I've noticed changes in the appearance of a mole, and it has become irregular in shape and color.",
                "I've been experiencing sudden hair loss and the skin on my scalp is becoming scaly.",
                "I've been experiencing frequent and severe headaches, often accompanied by visual disturbances.",
                "I've noticed weakness or numbness in one side of my body, along with difficulty speaking.",
                "I've been having persistent tremors or involuntary movements, especially in my hands.",
                "I've been experiencing persistent joint pain and stiffness, particularly in my knees and hips.",
                "I've recently suffered a sports injury and my ankle is swollen and painful.",
                "I've noticed a gradual deformity in the alignment of my spine, and my posture has changed.",
                "My child has been running a fever for the past two days and is complaining of a sore throat.",
                "My baby has developed a persistent rash on their skin, and it seems to be spreading.",
                "My child has been coughing and wheezing, especially at night, and seems to be having difficulty breathing.",
                "I've missed my menstrual periods, and I'm experiencing nausea and fatigue.",
                "I'm pregnant and experiencing heavy bleeding and abdominal pain.",
                "I've been having irregular vaginal bleeding between periods.",
                "I've been experiencing frequent and painful urination, along with lower abdominal discomfort.",
                "I've noticed blood in my urine, and I've had a persistent dull ache in my back.",
                "I'm having difficulty controlling my urine flow and often experience leakage.",
                "I've been experiencing swelling in my legs and ankles, along with frequent urination at night.",
                "I've noticed changes in my urine color, and I'm experiencing pain or discomfort in my lower back.",
                "I've been feeling unusually fatigued and have had a decreased appetite.",
                "I've been feeling extremely sad and hopeless for an extended period, and it's affecting my daily life.",
                "I've been experiencing severe anxiety and panic attacks, even in normal situations.",
                "I've noticed changes in my sleep patterns, appetite, and energy levels, and I'm losing interest in activities I used to enjoy.",
                "I've been experiencing sharp pain in my tooth whenever I eat or drink something hot or cold.",
                "I've noticed bleeding and inflammation in my gums, especially when I brush my teeth.",
                "I have a persistent bad taste in my mouth and bad breath despite regular oral hygiene.",
                "I've been experiencing persistent back pain, especially after sitting for long periods.",
                "I've injured my knee while playing sports, and it's swollen and painful.",
                "I've been having limited mobility in my shoulder, and it's causing discomfort and stiffness.",
                "I've been experiencing blurry vision, especially when trying to read or focus on objects.",
                "I've noticed sudden flashes of light and floating spots in my field of vision.",
                "I've been having persistent eye pain and redness, along with increased sensitivity to light.",
                "I've been experiencing recurrent sneezing, runny nose, and itchy, watery eyes, especially in certain environments.",
                "I've developed hives and skin rashes after consuming certain foods or coming into contact with specific substances.",
                "I've been having difficulty breathing and wheezing, especially when exposed to pollen or pet dander.",
                "I've been coughing persistently, and the cough is often accompanied by mucus production.",
                "I've noticed shortness of breath and wheezing, especially during physical activities.",
                "I've been experiencing chest tightness and discomfort, and it feels harder to take deep breaths.",
                "I have a persistent and large lump or mass on my body that has been growing.",
                "I've been experiencing severe abdominal pain that doesn't improve with medications.",
                "I've been diagnosed with appendicitis and need surgical removal of my appendix.",
                "I've been experiencing unexplained weight loss, increased thirst, and frequent urination.",
                "I've been feeling extremely fatigued, even after a full night's sleep.",
                "I've noticed changes in my menstrual cycle, including irregular periods and increased facial hair.",
                "I've been experiencing recurring ear infections and hearing loss.",
                "I've had persistent sinus congestion, facial pain, and post-nasal drip.",
                "I've been having difficulty swallowing, and I feel a lump in my throat.",
                "My newborn baby was born prematurely and requires specialized care due to their early arrival.",
                "My baby is experiencing difficulty breathing and requires assistance with respiratory support.",
                "My newborn has jaundice and requires monitoring and treatment to manage their bilirubin levels."
            ],
            "responses": [
                "Based on the symptoms you've described, I recommend consulting a [doctor].",
                "After analyzing your symptoms, I suggest you seek guidance from a [doctor].",
                "Considering your symptoms, it's advisable to consult with a [doctor].",
                "Given your symptoms, I recommend reaching out to a [doctor] for further evaluation.",
                "From what you've told me about your symptoms, it's best to consult a [doctor].",
                "I've reviewed your symptoms, and I believe you should consider seeing a [doctor].",
                "After considering your symptoms, I suggest you schedule an appointment with a [doctor].",
                "Based on your symptoms, I advise you to consult an experienced [doctor].",
                "Considering your symptoms, it would be wise to consult a qualified [doctor].",
                "According to your symptoms, I recommend seeking advice from a skilled [doctor].",
                "After analyzing your symptoms, I believe you should reach out to a knowledgeable [doctor].",
                "Given your symptoms, it's advisable to consult with an expert [doctor].",
                "From your description of symptoms, I suggest you consider visiting a [doctor].",
                "I've taken into account your symptoms, and I suggest you consult a [doctor].",
                "Based on your symptoms, I recommend you consult a specialized [doctor].",
                "Considering your symptoms, it's a good idea to seek guidance from a [doctor].",
                "After assessing your symptoms, I suggest you consult with a [doctor].",
                "From what you've shared, I suggest you consider seeing a [doctor].",
                "According to your symptoms, I recommend seeking advice from a [doctor].",
                "Given your symptoms, it's best to consult a skilled [doctor].",
                "Considering your symptoms, I suggest you schedule an appointment with a [doctor].",
                "After analyzing your symptoms, I believe you should reach out to a qualified [doctor].",
                "Based on your symptoms, I advise you to consult an experienced [doctor].",
                "From your description of symptoms, I suggest you consider visiting a [doctor].",
                "I've taken into account your symptoms, and I suggest you consult a [doctor].",
                "Considering your symptoms, I recommend you consult a specialized [doctor].",
                "After assessing your symptoms, I suggest you consult with a knowledgeable [doctor].",
                "Based on your symptoms, I suggest you seek guidance from a [doctor].",
                "Given your symptoms, it would be wise to consult with an expert [doctor].",
                "From what you've shared, I recommend you consult a qualified [doctor].",
                "According to your symptoms, I suggest you consider seeing a [doctor].",
                "Considering your symptoms, it's advisable to consult a [doctor].",
                "After analyzing your symptoms, I believe you should reach out to a [doctor].",
                "Based on your symptoms, I recommend seeking advice from a skilled [doctor].",
                "From your description of symptoms, I suggest you schedule an appointment with a [doctor].",
                "I've taken into account your symptoms, and I suggest you consult an experienced [doctor].",
                "Considering your symptoms, it's best to consult a specialized [doctor].",
                "After assessing your symptoms, I recommend you consult a knowledgeable [doctor].",
                "Based on your symptoms, I suggest you consider visiting a [doctor].",
                "Given your symptoms, I advise you to consult a [doctor].",
                "According to your symptoms, I suggest you consult a skilled [doctor].",
                "Considering your symptoms, it would be a good idea to reach out to a [doctor].",
                "From what you've shared, I recommend seeking advice from a qualified [doctor].",
                "After analyzing your symptoms, I suggest you consult with a specialized [doctor].",
                "Based on your symptoms, I believe you should consider seeing a [doctor].",
                "Considering your symptoms, I suggest you schedule an appointment with an expert [doctor].",
                "From your description of symptoms, I recommend you consult a knowledgeable [doctor].",
                "Given your symptoms, it's advisable to consult an experienced [doctor].",
                "According to your symptoms, I suggest you seek guidance from a [doctor].",
                "After assessing your symptoms, I suggest you consider visiting a [doctor]."
            ]
        },
        {
            "tag": "session_cancelation",
            "patterns": [
                "I need to cancel the appointment I scheduled at your hospital.",
                "Can you help me cancel the appointment I made at your hospital?",
                "I've decided to cancel my appointment at your hospital.",
                "I'd like to cancel the appointment I had previously booked at your hospital.",
                "Could you assist me in canceling my appointment at your hospital?",
                "I want to cancel the appointment I had arranged at your hospital.",
                "Please cancel the appointment I made at your hospital.",
                "I've changed my plans and need to cancel my appointment at your hospital.",
                "Can you cancel the appointment I had reserved at your hospital?",
                "I need to reschedule my appointment at your hospital. Can we cancel the current one?",
                "Please mark my appointment as canceled at your hospital.",
                "I'm no longer able to make it to the appointment at your hospital. Can we cancel it?",
                "I'd like to revoke the appointment I scheduled at your hospital.",
                "Could you cancel the appointment I had fixed at your hospital?",
                "Please cancel my appointment at your hospital. I won't be able to make it.",
                "I want to cancel my previously arranged appointment at your hospital.",
                "I need to cancel the appointment I had confirmed at your hospital.",
                "Can you cancel the appointment I made for [date/time] at your hospital?",
                "Please cancel my appointment at your hospital due to unforeseen circumstances.",
                "I'm afraid I won't be able to make it to my appointment at your hospital. Can we cancel it?",
                "I'd like to cancel the appointment I had scheduled with [doctor's name] at your hospital.",
                "Please cancel my appointment at your hospital as my plans have changed.",
                "I need to cancel my upcoming appointment at your hospital.",
                "Could you please assist me in canceling my appointment at your hospital?",
                "I want to cancel the appointment I made for [date/time] at your hospital.",
                "Please cancel the appointment I booked at your hospital. Something came up.",
                "I'd like to cancel my appointment at your hospital and reschedule it for another time.",
                "I'm unable to keep my appointment at your hospital. Can you help me cancel it?",
                "Can you please cancel the appointment I had arranged at your hospital?",
                "I need to cancel my appointment at your hospital due to personal reasons.",
                "Please cancel the appointment I had set for [date/time] at your hospital.",
                "I want to cancel my appointment with [doctor's name] at your hospital.",
                "I'd like to cancel the appointment I made at your hospital and schedule a new one.",
                "Please cancel the appointment I had confirmed for [date/time] at your hospital.",
                "I need to cancel my appointment at your hospital as my plans have changed.",
                "I'd like to cancel my appointment at your hospital and make a new reservation.",
                "Can you assist me in canceling the appointment I scheduled at your hospital?",
                "Please cancel the appointment I made at your hospital. I won't be able to attend.",
                "I want to cancel my appointment at your hospital and arrange for another date.",
                "I'd like to cancel my appointment at your hospital and reschedule it.",
                "Please cancel my appointment at your hospital. I won't be able to make it on [date/time].",
                "I need to cancel my appointment at your hospital due to an emergency.",
                "Can you cancel the appointment I had booked at your hospital? I need to change the date.",
                "I'd like to cancel my appointment at your hospital as something urgent has come up.",
                "Please cancel the appointment I had set at your hospital. I'll need to schedule another one later.",
                "I want to cancel the appointment I made at your hospital and book a new one.",
                "I need to cancel my appointment at your hospital and find a new suitable time.",
                "Please cancel the appointment I had confirmed at your hospital. I'll need to make a fresh appointment.",
                "I'd like to cancel my appointment at your hospital and reschedule it for a later date.",
                "Can you assist me in canceling the appointment I had previously made at your hospital?"
            ],
            "responses": [
                "I need the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please provide me with the session ID you got during the session booking process.",
                "I'd like to have the session ID that was provided to you when you booked your session.",
                "Can you give me the session ID you received after scheduling your session?",
                "I require the session ID you obtained at the time of booking your session.",
                "Could you kindly share the session ID you got while booking your session?",
                "Please share the session ID that was given to you when you scheduled your session.",
                "I'm looking for the session ID you received after booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "I need the session ID you received when you scheduled your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session."
            ]
        },
        {
            "tag": "session_reschedule",
            "patterns": [
                "I need to reschedule the appointment I scheduled at your hospital.",
                "Can you help me reschedule the appointment I made at your hospital?",
                "I've decided to change the date of my appointment at your hospital.",
                "I'd like to reschedule the appointment I had previously booked at your hospital.",
                "Could you assist me in rescheduling my appointment at your hospital?",
                "I want to change the date of the appointment I had arranged at your hospital.",
                "Please reschedule the appointment I made at your hospital.",
                "I've changed my plans and need to reschedule my appointment at your hospital.",
                "Can you reschedule the appointment I had reserved at your hospital?",
                "I need to find a new date for my appointment at your hospital. Can we reschedule it?",
                "Please mark my appointment as rescheduled at your hospital.",
                "I'm no longer able to make it to the appointment at your hospital. Can we reschedule it?",
                "I'd like to reschedule the appointment I scheduled with [doctor's name] at your hospital.",
                "Could you reschedule the appointment I had fixed at your hospital?",
                "Please reschedule my appointment at your hospital. I won't be able to make it.",
                "I want to change the date of my previously arranged appointment at your hospital.",
                "I need to reschedule the appointment I had confirmed at your hospital.",
                "Can you reschedule the appointment I made for [date/time] at your hospital?",
                "Please reschedule my appointment at your hospital due to unforeseen circumstances.",
                "I'm afraid I won't be able to make it to my appointment at your hospital. Can we reschedule it?",
                "I'd like to reschedule the appointment I had scheduled with [doctor's name] at your hospital.",
                "Please reschedule my appointment at your hospital as my plans have changed.",
                "I need to reschedule my upcoming appointment at your hospital.",
                "Could you please assist me in rescheduling my appointment at your hospital?",
                "I want to change the date of the appointment I made at your hospital.",
                "Please reschedule the appointment I booked at your hospital. Something came up.",
                "I'd like to reschedule my appointment at your hospital and find a new suitable date.",
                "I'm unable to keep my appointment at your hospital. Can you help me reschedule it?",
                "Can you please reschedule the appointment I had arranged at your hospital?",
                "I need to reschedule my appointment at your hospital due to personal reasons.",
                "Please reschedule the appointment I had set for [date/time] at your hospital.",
                "I want to change the date of my appointment with [doctor's name] at your hospital.",
                "I'd like to reschedule the appointment I made at your hospital and find an alternative date.",
                "Please reschedule the appointment I had confirmed for [date/time] at your hospital.",
                "I need to reschedule my appointment at your hospital as my plans have changed.",
                "I'd like to reschedule my appointment at your hospital and arrange for another date.",
                "Can you assist me in rescheduling the appointment I scheduled at your hospital?",
                "Please reschedule the appointment I made at your hospital. I won't be able to attend.",
                "I want to change the date of my appointment at your hospital and find a new one.",
                "I'd like to reschedule my appointment at your hospital and book a new one.",
                "Please reschedule my appointment at your hospital. I won't be able to make it on [date/time].",
                "I need to reschedule my appointment at your hospital due to an emergency.",
                "Can you reschedule the appointment I had booked at your hospital? I need to change the date.",
                "I'd like to reschedule my appointment at your hospital as something urgent has come up.",
                "Please reschedule the appointment I had set at your hospital. I'll need to schedule another one later.",
                "I want to change the date of my appointment at your hospital and find a more suitable time.",
                "I need to reschedule my appointment at your hospital and find a new available slot.",
                "Please reschedule the appointment I had confirmed at your hospital. I'll need to make a fresh appointment.",
                "I'd like to reschedule my appointment at your hospital and find a new convenient date.",
                "Can you please assist me in rescheduling the appointment I had previously made at your hospital?"
            ],
            "responses": [
                "I need the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please provide me with the session ID you got during the session booking process.",
                "I'd like to have the session ID that was provided to you when you booked your session.",
                "Can you give me the session ID you received after scheduling your session?",
                "I require the session ID you obtained at the time of booking your session.",
                "Could you kindly share the session ID you got while booking your session?",
                "Please share the session ID that was given to you when you scheduled your session.",
                "I'm looking for the session ID you received after booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "I need the session ID you received when you scheduled your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session."
            ]
        },
        {
            "tag": "contact_location",
            "patterns": [
                "Can you please provide me with the hospitals' location and the contact number?",
                "Could you please share the hospital's location and contact number with me?",
                "I'd appreciate it if you could give me the hospitals' location and the contact number.",
                "Would you mind sharing the hospital's location and contact number, please?",
                "May I request the hospitals' location and the contact number from you, please?",
                "I'm looking for the hospitals' location and contact number. Could you help me out?",
                "I need the hospitals' location and contact number. Can you provide them, please?",
                "If possible, please share the hospitals' location and contact number with me.",
                "I'd be grateful if you could give me the hospitals' location and contact number.",
                "Could you kindly provide me with the hospitals' location and the contact number?",
                "Can you please supply me with the hospitals' location and the contact number?",
                "Would you mind giving me the hospitals' location and the contact number?",
                "I'm in need of the hospitals' location and the contact number. Could you assist?",
                "Please share the hospitals' location and the contact number with me.",
                "If you could, please provide me with the hospitals' location and the contact number.",
                "Can you please offer the hospitals' location and the contact number?",
                "Could you kindly let me know the hospitals' location and the contact number?",
                "I require the hospitals' location and the contact number. Could you share them?",
                "Would you be able to give me the hospitals' location and the contact number?",
                "Can you please furnish me with the hospitals' location and the contact number?",
                "Could you please disclose the hospitals' location and the contact number?",
                "I'm looking for the hospitals' location and the contact number. Can you provide them?",
                "I need the hospitals' location and the contact number. Could you help me out?",
                "If possible, please share the hospitals' location and the contact number.",
                "I'd be grateful if you could provide me with the hospitals' location and the contact number.",
                "Can you please give me the hospitals' location and the contact number?",
                "Would you mind sharing the hospitals' location and the contact number, please?",
                "May I request the hospitals' location and the contact number from you, please?",
                "I'm looking for the hospitals' location and the contact number. Could you assist?",
                "Please share the hospitals' location and the contact number with me.",
                "If you could, please provide me with the hospitals' location and the contact number.",
                "Can you please offer the hospitals' location and the contact number?",
                "Could you kindly let me know the hospitals' location and the contact number?",
                "I require the hospitals' location and the contact number. Could you share them?",
                "Would you be able to give me the hospitals' location and the contact number?",
                "Can you please furnish me with the hospitals' location and the contact number?",
                "Could you please disclose the hospitals' location and the contact number?",
                "I'm looking for the hospitals' location and the contact number. Can you provide them?",
                "I need the hospitals' location and the contact number. Could you help me out?",
                "If possible, please share the hospitals' location and the contact number.",
                "I'd be grateful if you could provide me with the hospitals' location and the contact number.",
                "Can you please give me the hospitals' location and the contact number?",
                "Would you mind sharing the hospitals' location and the contact number, please?",
                "May I request the hospitals' location and the contact number from you, please?",
                "I'm looking for the hospitals' location and the contact number. Could you assist?",
                "Please share the hospitals' location and the contact number with me.",
                "If you could, please provide me with the hospitals' location and the contact number.",
                "Can you please offer the hospitals' location and the contact number?",
                "Could you kindly let me know the hospitals' location and the contact number?",
                "I require the hospitals' location and the contact number. Could you share them?"
            ],
            "responses": [
                "Certainly! Here is the location and contact info.",
                "Sure! Below is the location and contact information.",
                "Of course! Here's the location and contact details.",
                "Absolutely! Here's the location and contact info for you.",
                "Yes, here's the location and contact information you requested.",
                "Sure thing! Here's the location and contact info you need.",
                "No problem! Here's the location and contact information.",
                "You got it! Here's the location and contact info for you.",
                "Here you go! The location and contact info are as follows.",
                "Here's the location and contact info as you asked.",
                "Certainly! Below is the location and contact information.",
                "Sure! Here's the location and contact details.",
                "Of course! Here is the location and contact info.",
                "Absolutely! Here's the location and contact information.",
                "Yes, here's the location and contact info for you.",
                "Sure thing! Here's the location and contact info you need.",
                "No problem! Here's the location and contact information.",
                "You got it! Here's the location and contact info for you.",
                "Here you go! The location and contact info are as follows.",
                "Here's the location and contact info as you asked.",
                "Certainly! Here is the location and contact info.",
                "Sure! Below is the location and contact information.",
                "Of course! Here's the location and contact details.",
                "Absolutely! Here's the location and contact information.",
                "Yes, here's the location and contact info for you.",
                "Sure thing! Here's the location and contact info you need.",
                "No problem! Here's the location and contact information.",
                "You got it! Here's the location and contact info for you.",
                "Here you go! The location and contact info are as follows.",
                "Here's the location and contact info as you asked.",
                "Certainly! Below is the location and contact information.",
                "Sure! Here's the location and contact details.",
                "Of course! Here is the location and contact info.",
                "Absolutely! Here's the location and contact information.",
                "Yes, here's the location and contact info for you.",
                "Sure thing! Here's the location and contact info you need.",
                "No problem! Here's the location and contact information.",
                "You got it! Here's the location and contact info for you.",
                "Here you go! The location and contact info are as follows.",
                "Here's the location and contact info as you asked.",
                "Certainly! Here is the location and contact info.",
                "Sure! Below is the location and contact information.",
                "Of course! Here's the location and contact details.",
                "Absolutely! Here's the location and contact information.",
                "Yes, here's the location and contact info for you.",
                "Sure thing! Here's the location and contact info you need.",
                "No problem! Here's the location and contact information.",
                "You got it! Here's the location and contact info for you.",
                "Here you go! The location and contact info are as follows.",
                "Here's the location and contact info as you asked."
            ]
        },
        {
            "tag": "feedback",
            "patterns": [
                "I wanted to share my feedback about my recent hospital visit.",
                "I have some feedback to share from my recent experience at your hospital.",
                "I'd like to give feedback about the care I received during my hospital visit.",
                "Is there a way for me to submit feedback regarding my recent hospital visit?",
                "I'm interested in providing feedback about my recent visit to your hospital.",
                "Can I share my thoughts and feedback on my recent hospital visit with you?",
                "I'd appreciate the opportunity to give feedback about my recent hospital experience.",
                "How can I offer feedback about my recent visit to your hospital?",
                "I'd like to express my feedback regarding the service I received at your hospital.",
                "Is there a feedback form or process for my recent hospital visit?",
                "I want to provide feedback about the quality of care during my recent hospital visit.",
                "Could you guide me on how to give feedback about my recent hospital visit?",
                "I have some feedback about my recent visit to your hospital that I'd like to share.",
                "Can you direct me to the feedback system for my recent hospital visit?",
                "I'd like to share my feedback about the medical staff during my recent hospital visit.",
                "I want to provide feedback on the facilities and services at your hospital.",
                "Is there a specific way to provide feedback about my recent hospital stay?",
                "I'd appreciate the chance to give feedback on my recent experience at your hospital.",
                "How can I share my feedback about the hospital's amenities and accommodations?",
                "I'd like to offer feedback about the overall patient experience during my hospital visit.",
                "Could you tell me how to submit feedback about my recent hospital visit?",
                "I want to provide feedback about the cleanliness and hygiene at your hospital.",
                "Is there a platform or email where I can send my feedback regarding my hospital visit?",
                "I'd like to give feedback about the communication with the medical staff during my visit.",
                "Can you assist me with the process of providing feedback about my recent hospital visit?",
                "I want to share my feedback about the billing and administrative process at your hospital.",
                "I'd appreciate the opportunity to give feedback about the waiting times at your hospital.",
                "How can I offer feedback on the efficiency and organization of your hospital?",
                "I'd like to provide feedback on the level of care and attention I received at your hospital.",
                "Could you guide me on where to give feedback about the hospital's customer service?",
                "I want to express my feedback about the parking and accessibility at your hospital.",
                "Is there a feedback form available for my recent experience at your hospital?",
                "I'd like to share my feedback about the medical equipment and facilities at your hospital.",
                "Can you direct me to the feedback portal for my recent hospital visit?",
                "I want to provide feedback about the friendliness and professionalism of the staff at your hospital.",
                "Is there a designated email address where I can send my feedback regarding my hospital visit?",
                "I'd appreciate the chance to give feedback on the hospital's discharge process.",
                "How can I share my feedback about the hospital's follow-up care and support?",
                "I'd like to offer feedback about the information and resources provided during my hospital stay.",
                "Could you tell me how to submit feedback about the hospital's patient education materials?",
                "I want to provide feedback on the responsiveness and attentiveness of the hospital staff.",
                "Is there a platform where I can give feedback about my recent interaction with the hospital's nurses?",
                "I'd like to give feedback about the hospital's pain management and comfort measures.",
                "Can you assist me with the process of providing feedback about the hospital's dietary services?",
                "I want to share my feedback about the hospital's infection control and safety measures.",
                "Is there a survey or questionnaire for me to provide feedback about my hospital experience?",
                "I'd appreciate the opportunity to give feedback about the hospital's pharmacy services.",
                "How can I offer feedback on the hospital's communication and information sharing with patients?",
                "I'd like to provide feedback about the hospital's discharge planning and transition of care.",
                "Could you guide me on where to give feedback about the hospital's medical tests and diagnostics?"
            ],
            "responses": [
                "Absolutely! Your feedback holds immense value to us in our quest to improve our services every day. Please feel free to share your valuable feedback below.",
                "We genuinely appreciate your feedback, as it plays a crucial role in enhancing our services. Kindly take a moment to share your valuable feedback with us below.",
                "Thank you for considering sharing your feedback! Your insights are invaluable, and we're eager to hear your thoughts. Please type your valuable feedback below.",
                "Your feedback means a lot to us! It's an essential part of our continuous improvement journey. Please share your valuable feedback below.",
                "We highly value your feedback! It guides us in delivering the best possible care. Please take a moment to type your feedback below.",
                "We're grateful for your feedback as it empowers us to grow and serve you better. Kindly type your feedback in the box below.",
                "Your feedback is like a compass, directing us toward excellence. We're eager to hear from you. Please share your feedback below.",
                "We're committed to your satisfaction, and your feedback drives us in that direction. Please share your valuable feedback below.",
                "Your feedback is a precious gift that helps us excel. Thank you for taking the time to share your thoughts. Please type your feedback below.",
                "Your feedback is a cornerstone in shaping our services. We appreciate your valuable input. Please share your feedback below.",
                "We're here to listen! Your feedback is an integral part of our growth. Please take a moment to share your valuable feedback below.",
                "Your feedback is a driving force behind our progress. We're excited to hear what you have to say. Please type your feedback below.",
                "We treasure your feedback! It enables us to evolve and provide top-notch services. Kindly type your feedback in the box below.",
                "Your feedback is gold to us! We appreciate your valuable insights in making us better. Please type your feedback below.",
                "We believe in the power of your feedback! It shapes our journey towards excellence. Kindly share your valuable feedback in the box below.",
                "Your feedback is instrumental in our pursuit of perfection. We're all ears to your valuable thoughts. Please type your feedback below.",
                "We're grateful for your feedback, as it shapes our efforts to deliver exceptional care. Please share your feedback below.",
                "Your feedback is a critical piece of our puzzle, helping us achieve excellence. Kindly share your valuable feedback in the box below.",
                "We value your feedback as it propels us forward in our mission to provide the best care possible. Please type your feedback below.",
                "Your feedback is the foundation of our success. We're eager to hear your valuable insights. Please share your feedback below.",
                "Thank you for being an essential part of our improvement process! Your feedback is invaluable. Please share your valuable feedback below.",
                "We're all ears to hear about your recent experience! Your feedback guides us on the path of continuous improvement. Please type your feedback below.",
                "Your feedback is a guiding light that illuminates our way to excellence. We eagerly await your valuable thoughts. Please share your feedback below.",
                "We greatly value your feedback! It fuels our commitment to deliver outstanding services. Please take a moment to type your feedback below.",
                "Your feedback is like a compass, steering us toward perfection. We're eager to hear your valuable insights. Please type your feedback below.",
                "We're dedicated to making your experience better, and your feedback paves the way. Please share your valuable feedback below.",
                "Your feedback is a powerful tool that drives our continuous growth. We're all ears to hear what you have to say. Please type your feedback below.",
                "Thank you for choosing to share your feedback! Your thoughts are crucial in helping us improve our services. Please share your valuable feedback below.",
                "Your feedback is the fuel that propels our journey of improvement. We look forward to hearing your valuable insights. Please type your feedback below.",
                "We're on a mission to exceed your expectations, and your feedback is key. Please share your valuable feedback below.",
                "Your feedback is the key to unlock our potential. We're eager to know how we can serve you better. Please type your feedback below.",
                "Thank you for being a part of our improvement process! Your feedback drives us to excel. Please share your valuable feedback below.",
                "Your feedback serves as a compass, guiding us to elevate our services. We're all ears to hear your valuable thoughts. Please type your feedback below.",
                "We genuinely appreciate your feedback as it motivates us to provide exceptional care. Kindly take a moment to share your valuable feedback with us below.",
                "Your feedback fuels our passion to deliver top-notch services. We're eager to hear your thoughts. Please share your feedback below.",
                "Thank you for considering to provide your feedback! It plays a vital role in shaping our services. Please type your feedback below.",
                "Your feedback is our compass, pointing us toward continuous improvement. We're eager to hear from you. Please share your feedback below.",
                "We're committed to listening and learning from your feedback. It inspires us to strive for excellence. Please type your feedback below.",
                "Your feedback is the heartbeat of our growth. We're all ears to hear your valuable insights. Please share your feedback below.",
                "We're driven by your feedback! It helps us evolve and provide exceptional care. Kindly type your feedback in the box below.",
                "Your feedback is our north star, guiding us toward betterment. We value your thoughts. Please share your feedback below.",
                "Thank you for sharing your feedback! It's a vital ingredient in our recipe for improvement. Please type your valuable feedback below.",
                "Your feedback is the wind beneath our wings, propelling us to soar higher. We eagerly await your valuable thoughts. Please share your feedback below.",
                "We're all ears to hear your feedback! It empowers us to make positive changes. Please take a moment to type your feedback below.",
                "Your feedback is a beacon of inspiration, illuminating our path to excellence. Please share your valuable feedback below.",
                "We're grateful for your feedback, as it shapes our efforts to deliver exceptional care. Please share your feedback below.",
                "Your feedback is a critical piece of our puzzle, helping us achieve excellence. Kindly share your valuable feedback in the box below.",
                "We value your feedback as it propels us forward in our mission to provide the best care possible. Please type your feedback below.",
                "Your feedback is the foundation of our success. We're eager to hear your valuable insights. Please share your feedback below.",
                "Thank you for considering sharing your feedback with us! Your thoughts drive our continuous improvement. Please type your feedback below."
            ]
        },
        {
            "tag": "addmission_enqiry",
            "patterns": [
                "I am seeking admission for a patient to your esteemed hospital.",
                "Could you assist me in requesting admission for a patient at your hospital?",
                "I'd like to request hospital admission on behalf of a patient.",
                "Is it possible to admit a patient to your hospital upon my request?",
                "I'm inquiring about the process for admitting a patient to your hospital.",
                "Please consider this as my formal request for patient admission to your hospital.",
                "I have a patient in need of hospitalization and would like to request admission.",
                "Could you provide guidance on how to request hospital admission for a patient?",
                "I'm looking to arrange for a patient's admission to your hospital.",
                "I'd appreciate your assistance in facilitating the admission of a patient to your hospital.",
                "Is there a specific procedure for requesting hospital admission for a patient?",
                "I am interested in having a patient admitted to your hospital, if possible.",
                "Please let me know the steps required to request patient admission to your hospital.",
                "I'm hoping to request admission for a patient under my care to your hospital.",
                "I'd like to inquire about the possibility of admitting a patient to your hospital.",
                "Could you please inform me of the process to request hospital admission for a patient?",
                "I have a patient who needs medical care and would like to request admission to your hospital.",
                "Is it feasible to arrange for a patient's admission to your hospital at this time?",
                "I'm formally requesting hospital admission for a patient under my responsibility.",
                "Please consider this as my official request for patient admission to your hospital.",
                "I'm looking to have a patient admitted to your hospital and would appreciate your help.",
                "Could you guide me on how to proceed with the request for hospital admission for a patient?",
                "I'd like to discuss the possibility of admitting a patient to your hospital.",
                "I'm interested in initiating the process for patient admission to your hospital.",
                "Please let me know the necessary steps to request hospital admission for a patient.",
                "I have a patient who requires medical attention and would like to request admission.",
                "Is it within your capacity to accommodate the admission of a patient to your hospital?",
                "I'm seeking assistance in arranging for a patient's admission to your hospital.",
                "Could you provide information on how to request hospital admission for a patient?",
                "I am formally requesting admission to your hospital on behalf of a patient.",
                "I'm inquiring about the possibility of admitting a patient to your hospital.",
                "Please let me know the protocol for requesting patient admission to your hospital.",
                "I'd like to discuss the option of having a patient admitted to your hospital.",
                "I'm looking to request admission for a patient who needs medical care at your hospital.",
                "Could you guide me on the process for requesting hospital admission for a patient?",
                "I'm interested in having a patient admitted to your hospital and would like your assistance.",
                "Is it possible to initiate the process for patient admission to your hospital?",
                "I have a patient in need of hospitalization and would like to request their admission.",
                "Please consider this as my formal request to admit a patient to your hospital.",
                "I'm hoping to request admission for a patient in my care to your hospital.",
                "Could you please provide information on how to request hospital admission for a patient?",
                "I'd like to inquire about the process of admitting a patient to your hospital.",
                "I'm formally requesting hospital admission for a patient who requires medical attention.",
                "Please let me know the steps required to request admission for a patient at your hospital.",
                "I have a patient who needs immediate medical care and would like to request admission.",
                "Is it feasible to arrange for a patient's admission to your hospital at this time?",
                "I'm requesting your assistance in facilitating the admission of a patient to your hospital.",
                "Could you guide me on the steps to request hospital admission for a patient?",
                "I'm looking to have a patient admitted to your hospital and would appreciate your guidance.",
                "Please consider this as my official request for hospital admission on behalf of a patient."
            ],
            "responses": [
                "Certainly! Since this involves hospital admission, feel free to reach out to any of the contact numbers below, and they will guide you through the entire process.",
                "Of course! If you need assistance with hospital admission, you can contact any of the numbers provided below, and they will be more than happy to help you.",
                "Sure thing! For matters related to hospital admission, you can get in touch with any of the contact numbers listed below, and they'll provide you with thorough assistance.",
                "Absolutely! If you have questions about hospital admission, don't hesitate to call any of the numbers mentioned below. They'll walk you through the process.",
                "You got it! To inquire about hospital admission, just reach out to any of the contact numbers below, and they will assist you every step of the way.",
                "No problem at all! If you require information on hospital admission, the numbers provided below are there to help you with the process.",
                "Certainly! If you need help with hospital admission, don't hesitate to contact any of the numbers below, and they'll provide you with all the necessary support.",
                "Of course! For matters related to hospital admission, you can call any of the contact numbers listed below, and they'll offer comprehensive assistance.",
                "Sure thing! If you have queries about hospital admission, reach out to any of the numbers mentioned below, and they'll be at your service.",
                "Absolutely! For hospital admission inquiries, you can contact any of the numbers provided below, and they will guide you through the process.",
                "You got it! If you require assistance with hospital admission, don't hesitate to call any of the contact numbers below, and they'll be glad to help.",
                "No problem at all! For questions about hospital admission, the numbers provided below are at your disposal, and they'll assist you thoroughly.",
                "Certainly! If you need information on hospital admission, just get in touch with any of the contact numbers below, and they'll provide you with the necessary guidance.",
                "Of course! If you have concerns about hospital admission, feel free to reach out to any of the numbers mentioned below, and they'll be there to assist you.",
                "Sure thing! For hospital admission queries, you can call any of the numbers provided below, and they'll be more than happy to help you out.",
                "Absolutely! If you require support with hospital admission, don't hesitate to contact any of the numbers below, and they'll walk you through the process.",
                "You got it! To inquire about hospital admission, just reach out to any of the contact numbers mentioned below, and they'll offer their full assistance.",
                "No problem at all! If you need help with hospital admission, the numbers provided below are there for your convenience, and they'll provide all the necessary information.",
                "Certainly! If you have questions regarding hospital admission, feel free to call any of the contact numbers below, and they'll be at your service.",
                "Of course! For matters related to hospital admission, you can get in touch with any of the numbers listed below, and they'll guide you through the process.",
                "Sure thing! If you need assistance with hospital admission, don't hesitate to contact any of the numbers provided below, and they'll be glad to help.",
                "Absolutely! If you require information on hospital admission, reach out to any of the contact numbers below, and they'll assist you every step of the way.",
                "You got it! For hospital admission inquiries, you can contact any of the numbers mentioned below, and they will be more than willing to help you.",
                "No problem at all! If you have queries about hospital admission, the numbers provided below are available to address your concerns and provide support.",
                "Certainly! If you need information on hospital admission, just get in touch with any of the contact numbers below, and they'll provide you with the necessary assistance.",
                "Of course! If you have concerns about hospital admission, feel free to call any of the numbers mentioned below, and they'll be there to assist you.",
                "Sure thing! For hospital admission queries, you can call any of the numbers provided below, and they'll be more than happy to help you out.",
                "Absolutely! If you require support with hospital admission, don't hesitate to contact any of the numbers below, and they'll walk you through the process.",
                "You got it! To inquire about hospital admission, just reach out to any of the contact numbers mentioned below, and they'll offer their full support.",
                "No problem at all! If you need help with hospital admission, the numbers provided below are there to assist you, and they'll provide all the necessary information.",
                "Certainly! If you have any questions about hospital admission, feel free to reach out to any of the contact numbers below. They'll provide you with guidance throughout the process.",
                "Of course! For inquiries regarding hospital admission, you can contact any of the numbers provided below, and they'll be there to guide you through the necessary steps.",
                "Sure thing! If you need assistance with hospital admission, don't hesitate to call any of the numbers below. They're ready to help and will walk you through the entire process.",
                "Absolutely! If you require information on hospital admission, feel free to get in touch with any of the contact numbers below. They'll be happy to assist you with the process.",
                "You got it! For matters concerning hospital admission, you can reach out to any of the numbers listed below, and they'll be available to guide you every step of the way.",
                "No problem at all! If you need help with hospital admission, the numbers provided below are there to assist you. They'll offer support throughout the process.",
                "Certainly! If you have any queries about hospital admission, don't hesitate to contact any of the numbers below. They'll be at your service and provide the necessary guidance.",
                "Of course! For matters related to hospital admission, you can get in touch with any of the numbers listed below, and they'll be ready to guide you through the process.",
                "Sure thing! If you need assistance with hospital admission, you can call any of the numbers below. They're well-equipped to help and will walk you through the process.",
                "Absolutely! If you require information on hospital admission, feel free to reach out to any of the contact numbers below. They'll assist you throughout the process.",
                "You got it! For matters concerning hospital admission, you can contact any of the numbers provided below. They'll be available to guide you through the necessary steps.",
                "No problem at all! If you need help with hospital admission, the numbers provided below are there for your convenience. They'll provide support during the process.",
                "Certainly! If you have any questions regarding hospital admission, feel free to call any of the numbers below. They'll be at your service and offer guidance.",
                "Of course! For inquiries related to hospital admission, you can get in touch with any of the numbers listed below, and they'll be ready to guide you.",
                "Sure thing! If you need assistance with hospital admission, don't hesitate to contact any of the numbers below. They'll be glad to help and walk you through the process.",
                "Absolutely! If you require information on hospital admission, feel free to reach out to any of the contact numbers below. They'll be available to assist you.",
                "You got it! For matters concerning hospital admission, you can call any of the numbers provided below. They'll be at your disposal to guide you throughout the process.",
                "No problem at all! If you need help with hospital admission, the numbers provided below are there to assist you. They'll offer support and guidance.",
                "Certainly! If you have any queries about hospital admission, feel free to get in touch with any of the numbers below. They'll be ready to provide assistance.",
                "Of course! For matters related to hospital admission, you can contact any of the numbers listed below, and they'll be prepared to guide you through the process."
            ]
        },
        {
            "tag": "service_completion",
            "patterns": [
                "That covers everything I needed, thank you.",
                "I don't need anything else, thank you.",
                "I'm good with the information provided.",
                "I have no further requests, thank you.",
                "That's all for now, thanks.",
                "I'm satisfied with the assistance.",
                "I don't require any more help, thanks.",
                "That's all I was looking for.",
                "No, I have no further inquiries.",
                "No, that's sufficient for now.",
                "No, I don't require any more assistance.",
                "No, that's the conclusion of our discussion.",
                "No, that's everything I was looking for.",
                "No, I don't have any other queries.",
                "No, that's all I wanted to discuss.",
                "No, I'm done with my requests.",
                "No, that's all I needed help with.",
                "No, that completes our conversation.",
                "No, I have no more issues to address.",
                "No, I'm happy with the information provided.",
                "No, I don't need any further explanations.",
                "No, that's the end of my inquiries.",
                "No, I don't have any additional questions.",
                "No, that's all for this interaction.",
                "No, I'm satisfied with the support received.",
                "No, I have no more matters to discuss.",
                "No, that covers all my requirements.",
                "No, I don't need any more details.",
                "No, that's all I wanted to clarify.",
                "No, I'm content with the service rendered.",
                "I'm satisfied with the resolution, thanks.",
                "That covers all my requirements, thanks.",
                "I have no more issues to raise, thank you.",
                "That's everything I wanted to confirm, thanks.",
                "I'm done with my inquiries, thank you.",
                "That's the end of my queries, thanks.",
                "I don't have any other questions, thanks.",
                "That's all for this interaction, thank you.",
                "I'm content with the assistance provided.",
                "I have no further matters, thank you.",
                "That's the conclusion of our conversation, thanks.",
                "I don't need any additional information, thanks.",
                "That's all I needed from you, thank you.",
                "I'm satisfied with the help received.",
                "I have no more points to discuss, thank you.",
                "That's sufficient for my needs, thanks.",
                "I don't require any more details, thanks.",
                "That's all I wanted to verify, thank you.",
                "I'm done with my questions, thanks.",
                "That's the end of our discussion for now, thanks.",
                "I have no further requests, thank you."
            ],
            "responses": [
                "I'm glad I could assist you. If you require anything in the future, don't hesitate to ask or contact our hospital helpline for further support.",
                "It was my pleasure to help you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm happy I could be of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm delighted to have assisted you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm pleased that I could help. If you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm grateful for the opportunity to assist you. Should you need anything else in the future, don't hesitate to reach out to me or the hospital helpline for further assistance.",
                "I'm honored to have been of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm thankful for the chance to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm elated I could be of service. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm overjoyed that I could assist you. Should you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm pleased I could be of assistance. If you require anything else in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you need anything else in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm delighted I could assist you. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further guidance.",
                "I'm glad to have been of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm grateful I could help. If you have any more questions in the future, don't hesitate to reach out to me or the hospital helpline for further information.",
                "I'm honored to have had the opportunity to assist you. Should you need anything else in the future, don't hesitate to ask or contact the hospital helpline for further assistance.",
                "I'm thankful for the chance to be of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm elated to have been able to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm pleased I could be of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm overjoyed that I could assist you. Should you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm glad I could be of assistance. If you require anything else in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you need anything else in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm delighted I could assist you. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further guidance.",
                "I'm pleased to have been of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm grateful I could help. If you have any more questions in the future, don't hesitate to reach out to me or the hospital helpline for further information.",
                "I'm honored to have had the opportunity to assist you. Should you need anything else in the future, don't hesitate to ask or contact the hospital helpline for further assistance.",
                "I'm thankful for the chance to be of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm elated to have been able to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm pleased I could be of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm overjoyed that I could assist you. Should you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm glad I could be of assistance. If you require anything else in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you need anything else in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm delighted I could assist you. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further guidance.",
                "I'm pleased to have been of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm grateful I could help. If you have any more questions in the future, don't hesitate to reach out to me or the hospital helpline for further information.",
                "I'm honored to have had the opportunity to assist you. Should you need anything else in the future, don't hesitate to ask or contact the hospital helpline for further assistance.",
                "I'm thankful for the chance to be of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm elated to have been able to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm pleased I could be of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm glad I could assist you. If you require any more help in the future, don't hesitate to ask me or contact the hospital helpline for further guidance.",
                "It was my pleasure to be of service. If you need anything else in the future, feel free to reach out to me or the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you have any more inquiries in the future, don't hesitate to ask me or the hospital helpline for further assistance.",
                "I'm delighted to have been of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm honored that I could assist you. If you have any more questions in the future, don't hesitate to ask me or the hospital helpline for further information.",
                "I'm thankful for the opportunity to be of service. Should you need anything else in the future, don't hesitate to ask me or the hospital helpline for further support.",
                "I'm glad I could be of help. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for additional guidance.",
                "I'm pleased to have provided assistance. Should you have any more inquiries in the future, don't hesitate to ask me or the hospital helpline for further assistance.",
                "I'm happy that I could be of service. If you require any more help in the future, don't hesitate to ask me or the hospital helpline for further support.",
                "I'm delighted to have been able to assist you. Should you have any more questions in the future, don't hesitate to ask me or the hospital helpline for further information.",
                "I'm honored to have helped you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for additional guidance."
            ]
        },
        {
            "tag": "fallback",
            "patterns": [
                "",
                " ",
                "blah blah blah",
                "???",
                "I'm not sure what to ask, I'm just trying to see how you respond to different types of questions.",
                "Can you understand me? Sometimes it feels like I'm not making much sense with my inquiries.",
                "Why are you not responding properly to my queries? I thought you were supposed to be smart.",
                "Are you even a real chatbot, or just some random program generating automated responses?",
                "This doesn't make any sense to me; I'm asking about hospital services, and you're talking about weather.",
                "Can you speak English? I hope you're not using some alien language I can't comprehend.",
                "What's the meaning of life? I know it's a deep question, but I thought I'd give it a shot.",
                "Tell me a joke or something amusing; I could use a good laugh right now.",
                "Why can't you answer my question properly? It's frustrating when you don't get what I mean.",
                "I need help with my personal problems, but I guess you're just a chatbot, not a therapist.",
                "Can I marry you? Just kidding, of course, but let's see how you respond to a random question.",
                "What's the weather like today? Oh, wait, I think I got the wrong chatbot for that.",
                "Do you like pizza? I wonder if AI chatbots have food preferences.",
                "I'm feeling sad, and I thought talking to a chatbot might cheer me up, but it seems it won't work.",
                "Tell me about your family or your creators; I'm curious about the minds behind this AI.",
                "What's your favorite color? I know it's a strange question for a chatbot, but I'm curious.",
                "Do you have any pets? Or do chatbots have digital pets, if that's even a thing?",
                "Who is the president of [random country]? Just thought I'd test your knowledge.",
                "What's the capital of [random city]? Sorry for the random geography question.",
                "I want to buy a car, but I doubt you can help me with that decision.",
                "What's the best restaurant in town? I need some local recommendations.",
                "What's the meaning of this word? I feel like I'm in a dictionary mode now.",
                "Can you do my homework? Just kidding, I know you're not a cheating machine.",
                "How tall is the Eiffel Tower? Just testing your general knowledge.",
                "Can you tell me a bedtime story? I know it's a bit childish, but why not?",
                "What's the square root of 576? I need some math help here.",
                "What's the formula for calculating velocity? Oh, I see, you're not a physics expert.",
                "What's the airspeed velocity of an unladen swallow? An old-school Monty Python reference!",
                "Where is Atlantis located? I know it's a myth, but let's play along.",
                "Tell me about the secret of the Bermuda Triangle. I'm into mysterious stuff.",
                "How do I time travel? Just wondering if you have any sci-fi tips.",
                "What's the recipe for a magic potion? Maybe you can create some digital magic.",
                "What's the cure for a broken heart? A chatbot's response might not be enough.",
                "Can you recommend a good movie to watch? I'm in the mood for something entertaining.",
                "Who won the World Series in 1953? Let's see if you have historical sports knowledge.",
                "What's the best way to win the lottery? I know it's a long shot, but any tips?",
                "Can you teach me how to fly? I'm just kidding, of course.",
                "I'm lost, can you help me find my way home? I hope you have a digital GPS.",
                "What's the meaning of the universe? I know, I know, it's a big question.",
                "Can you help me with my love life? I doubt AI can solve relationship problems.",
                "What's the best way to make money quickly? Asking for a friend, you know.",
                "I need advice on how to become a millionaire. It's a dream, I guess.",
                "What's the secret to eternal youth? Just curious if you have any age-defying secrets.",
                "What's the best diet for losing weight? A chatbot nutritionist might be helpful!",
                "Can you tell me a secret? A chatbot with secrets, intriguing.",
                "How do I become invisible? Just testing your superpower knowledge.",
                "Can you predict my future? You know, like a digital fortune teller.",
                "What's the meaning of this dream I had last night? I know, it's a bit personal.",
                "Can you tell me about the meaning of life according to some famous philosopher?",
                "Can you recite the first 100 digits of pi? I know it's a random challenge."
            ],
            "responses": [
                "I'm sorry, but I'm having trouble understanding your message. As a healthcare chatbot, feel free to explore any health-related questions below.",
                "Apologies, I'm having difficulty comprehending your input. You can inquire about medical topics from the options provided.",
                "I apologize, I can't seem to grasp what you're saying. You have the freedom to ask anything related to healthcare from the list below.",
                "I'm sorry, but your message is unclear to me. If you have any health-related inquiries, you can explore the options provided.",
                "Apologies for any confusion. As a healthcare chatbot, I'm here to help with any medical queries mentioned below.",
                "I'm afraid I can't understand your question. Feel free to explore health-related matters using the options below.",
                "Sorry, I can't comprehend your message at the moment. Please find health-related topics to inquire about below.",
                "I apologize, but I'm unable to interpret your query. You can explore health-related subjects from the provided options.",
                "I'm sorry, your message is not clear to me. You can inquire about various healthcare topics mentioned below.",
                "Apologies, I couldn't understand your input. Please explore various healthcare categories from the options mentioned below.",
                "I'm sorry, but I can't process your message. You can discover health-related information from the topics mentioned below.",
                "I apologize for any confusion. You can ask me about various healthcare topics available below.",
                "I'm afraid I can't comprehend your question. Feel free to explore health-related subjects listed below.",
                "Sorry, I can't seem to grasp what you're saying. Please find health-related categories mentioned below.",
                "I apologize, but your message is unclear to me. You can find information on different medical topics below.",
                "I'm sorry, but I'm having trouble understanding your query. Please find various medical topics below.",
                "I apologize, I can't understand your question. You have the freedom to inquire about healthcare matters below.",
                "I'm afraid I can't comprehend your message at the moment. If you have any health-related inquiries, find the topics below.",
                "Sorry, I can't process your message properly. Feel free to explore health-related subjects from the provided list.",
                "I apologize, I'm unable to interpret your query. You can explore health-related topics from the options provided.",
                "I'm sorry, your message is not clear to me. You can discover health-related information from the listed categories.",
                "Apologies, I couldn't understand your input. Please explore various health-related subjects mentioned below.",
                "I'm sorry, but I can't process your message. You can find information on different medical areas below.",
                "I apologize for any confusion. You can ask me about various medical topics available in the options below.",
                "I'm afraid I can't comprehend your question. Feel free to explore health-related inquiries listed below."
            ]
        },
        {
            "tag": "payment",
            "patterns": [
                "What are the payment options for this appointment?",
                "How do I go about paying for my scheduled appointment?",
                "Can you provide information on the payment process for this appointment?",
                "I want to know how to make a payment for this appointment.",
                "What are the available payment methods for this appointment?",
                "How can I settle the payment for my upcoming appointment?",
                "Tell me about the payment procedures for this appointment.",
                "Can you guide me through the payment process for this appointment?",
                "I'm interested in knowing the payment details for this appointment.",
                "What are the accepted payment modes for this appointment?",
                "How should I pay for my confirmed appointment?",
                "Can you explain how to make a payment for this appointment?",
                "What payment options are there for this scheduled appointment?",
                "I need information about the payment arrangements for this appointment.",
                "How can I proceed with the payment for my appointment?",
                "What's the preferred way to pay for this appointment?",
                "Tell me how to finalize the payment for this appointment.",
                "What's the process for making a payment for my appointment?",
                "Can you provide me with the payment instructions for this appointment?",
                "I'd like to know the steps to pay for my upcoming appointment.",
                "What's the procedure for paying the fees for this appointment?",
                "How can I make the necessary payment for this appointment?",
                "Tell me about the payment methods accepted for this appointment.",
                "I need guidance on how to pay for my scheduled appointment.",
                "What options do I have for paying for this appointment?",
                "Can you explain the payment process for this particular appointment?",
                "How do I proceed with the payment for this confirmed appointment?",
                "I want to ensure I pay for this appointment correctly. Can you help?",
                "What's the recommended way to pay for this appointment?",
                "Tell me about the payment requirements for this appointment.",
                "I'm interested in knowing the accepted payment options for this appointment.",
                "How should I go about making the payment for this appointment?",
                "Can you guide me through the payment steps for this appointment?",
                "What payment modes are available for me to pay for this appointment?",
                "How can I settle the payment for this upcoming appointment?",
                "Tell me the details for making the payment for this appointment.",
                "I need to understand how to pay for my confirmed appointment.",
                "What are the options to pay for this appointment?",
                "Can you provide information on the payment methods for this appointment?",
                "How do I go about paying for this appointment I just booked?",
                "I want to know the available payment choices for this appointment.",
                "What are the payment arrangements for this scheduled appointment?",
                "How can I proceed with the payment for my confirmed appointment?",
                "Tell me how to make a secure payment for this appointment.",
                "What's the process for completing the payment for this appointment?",
                "Can you explain the different ways to pay for this appointment?",
                "How do I finalize the payment for this scheduled appointment?",
                "I'd like to receive instructions on how to pay for this appointment.",
                "What payment methods can I use to pay for this appointment?",
                "Tell me about the payment options available for this appointment."
            ],
            "responses": [
                "No need to worry! Payment is due after your appointment at the hospital.",
                "You can relax! Payment can be made after your appointment, right at the hospital.",
                "No worries! You'll make the payment at the hospital after your appointment.",
                "Not to worry! Payment is handled at the hospital after your appointment.",
                "Rest assured! Payment is taken care of after your appointment, right at the hospital.",
                "No need to stress! You can pay after your appointment, at the hospital.",
                "You don't have to fret! Payment is made after your appointment, at the hospital.",
                "Don't be concerned! Payment will be collected at the hospital after your appointment.",
                "No need to be anxious! You'll pay after your appointment, at the hospital.",
                "You can be at ease! Payment will be requested at the hospital after your appointment.",
                "Don't worry! We'll handle the payment process after your appointment, at the hospital.",
                "No worries! You'll make the payment right at the hospital after your appointment.",
                "You don't have to worry about that! Payment will be taken at the hospital after your appointment.",
                "Not to worry! Payment is processed at the hospital after your appointment.",
                "Rest assured! You'll settle the payment after your appointment, at the hospital.",
                "No need to stress about payment! It's handled after your appointment, at the hospital.",
                "Don't be concerned about that! Payment will be managed at the hospital after your appointment.",
                "You can relax about payment! It's done after your appointment, at the hospital.",
                "Don't worry at all! Payment is scheduled for after your appointment, at the hospital.",
                "No need to be anxious! Payment is received at the hospital after your appointment.",
                "You can be at ease! Payment is taken care of after your appointment, at the hospital.",
                "Don't worry about the payment process! It's completed at the hospital after your appointment.",
                "No worries! Payment arrangements are made after your appointment, at the hospital.",
                "You don't have to fret! Payment will be processed at the hospital after your appointment.",
                "Not to worry at all! Payment will be collected at the hospital after your appointment.",
                "Rest assured! Payment can be settled after your appointment, at the hospital.",
                "No need to stress over it! Payment is handled after your appointment, at the hospital.",
                "Don't be concerned about payment! It's taken care of after your appointment, at the hospital.",
                "You can relax about the payment! It's processed after your appointment, at the hospital.",
                "Don't worry! You'll make the payment at the hospital after your appointment.",
                "No worries! Payment will be requested after your appointment, at the hospital.",
                "You don't have to fret about payment! It's managed after your appointment, at the hospital.",
                "Not to worry! Payment is scheduled after your appointment, at the hospital.",
                "Rest assured! Payment is received after your appointment, at the hospital.",
                "No need to stress about it! Payment will be made at the hospital after your appointment.",
                "Don't be concerned! Payment arrangements are made after your appointment, at the hospital.",
                "You can be at ease about payment! It's completed after your appointment, at the hospital.",
                "Don't worry at all! Payment will be processed after your appointment, at the hospital.",
                "No worries! Payment is collected after your appointment, at the hospital.",
                "You don't have to fret! Payment is taken care of after your appointment, at the hospital.",
                "Not to worry! You'll settle the payment after your appointment, at the hospital.",
                "Rest assured! Payment will be managed after your appointment, at the hospital.",
                "No need to stress about the payment process! It's done after your appointment, at the hospital.",
                "Don't be concerned! Payment is received after your appointment, at the hospital.",
                "You can relax! Payment can be made after your appointment, at the hospital.",
                "Don't worry! We'll handle the payment process after your appointment, at the hospital.",
                "No worries! You'll make the payment right at the hospital after your appointment.",
                "You don't have to worry about that! Payment will be taken at the hospital after your appointment.",
                "Not to worry! Payment is processed at the hospital after your appointment.",
                "Rest assured! You'll pay after your appointment, at the hospital."
            ]
        },
        {
            "tag": "medical_services",
            "patterns": [
                "Tell me about the healthcare services and facilities available at your hospital.",
                "I'd like to know the range of medical services and facilities offered at your hospital.",
                "What medical services and facilities can I expect at your hospital?",
                "Can you provide information about the medical services and facilities you have?",
                "I'm interested in learning about the healthcare services and facilities provided by your hospital.",
                "Tell me what types of medical services and facilities are available at your hospital.",
                "What are the medical services and facilities you offer to patients?",
                "Please give me an overview of the healthcare services and facilities at your hospital.",
                "I'd like to know the various medical services and facilities at your hospital.",
                "Can you list the medical services and facilities provided by your hospital?",
                "What healthcare services and facilities do you have for patients?",
                "Tell me about the medical services and facilities that I can access at your hospital.",
                "I'm curious about the medical services and facilities available at your hospital.",
                "What are the healthcare services and facilities that your hospital extends?",
                "Please provide details about the medical services and facilities offered at your hospital.",
                "I want to know what medical services and facilities I can find at your hospital.",
                "Can you share information on the healthcare services and facilities you offer?",
                "Tell me about the various medical services and facilities at your hospital.",
                "What medical services and facilities are accessible at your hospital?",
                "I'd appreciate it if you could brief me about the medical services and facilities you provide.",
                "Please enlighten me on the healthcare services and facilities at your hospital.",
                "What types of medical services and facilities does your hospital have?",
                "Can you explain the medical services and facilities available at your hospital?",
                "Tell me what medical services and facilities I'll find at your hospital.",
                "What are the healthcare services and facilities that your hospital extends to patients?",
                "I'm interested in knowing about the medical services and facilities offered by your hospital.",
                "Can you list the healthcare services and facilities provided at your hospital?",
                "Please give me an overview of the medical services and facilities at your hospital.",
                "I'd like to learn more about the medical services and facilities available at your hospital.",
                "What healthcare services and facilities do you have for patients' convenience?",
                "Tell me about the medical services and facilities that I can avail at your hospital.",
                "I'm curious to know about the medical services and facilities available at your hospital.",
                "What are the healthcare services and facilities that your hospital offers to patients?",
                "Please provide details about the medical services and facilities extended by your hospital.",
                "I want to know what medical services and facilities I'll have access to at your hospital.",
                "Can you share information on the medical services and facilities you provide?",
                "Tell me about the various healthcare services and facilities at your hospital.",
                "What medical services and facilities are accessible to patients at your hospital?",
                "I'd appreciate it if you could brief me about the healthcare services and facilities you offer.",
                "Please enlighten me on the medical services and facilities available at your hospital.",
                "What types of healthcare services and facilities does your hospital have?",
                "Can you explain the healthcare services and facilities available at your hospital?",
                "Tell me what medical services and facilities I can find at your hospital.",
                "What are the healthcare services and facilities that your hospital extends to patients?",
                "I'm interested in knowing about the healthcare services and facilities offered by your hospital.",
                "Can you list the medical services and facilities provided at your hospital?",
                "Please give me an overview of the healthcare services and facilities at your hospital.",
                "I'd like to learn more about the healthcare services and facilities available at your hospital.",
                "What medical services and facilities do you have for patients' convenience?",
                "Tell me about the healthcare services and facilities that I can avail at your hospital."
            ],
            "responses": [
                "Certainly! Our hospital offers an extensive range of medical services and facilities. For detailed information, please visit this link.",
                "Absolutely! We have a wide array of medical services and facilities available. To explore more, click on this link.",
                "Of course! Our hospital takes pride in providing numerous medical services and top-notch facilities. You can find all the details in this link.",
                "Sure thing! We offer a plethora of medical services and facilities. Click here to access all the information.",
                "Definitely! With a vast array of medical services and facilities, you can find everything you need at this link.",
                "Absolutely! You'll be amazed by the variety of medical services and facilities we provide. Click this link to learn more.",
                "Of course! Our hospital boasts an extensive range of medical services and state-of-the-art facilities. Find all the details in this link.",
                "Certainly! We offer a wide range of medical services and modern facilities. All the information can be found in this link.",
                "Sure thing! From a diverse range of medical services to top-class facilities, you'll find it all at this link.",
                "Definitely! You'll be delighted to explore the numerous medical services and facilities we have. Access all the details through this link.",
                "Absolutely! Click on this link to discover the abundance of medical services and facilities available at our hospital.",
                "Of course! With a myriad of medical services and excellent facilities, you'll find everything you need by following this link.",
                "Certainly! We take pride in offering an extensive range of medical services and cutting-edge facilities. Click here to learn more.",
                "Sure thing! Our hospital provides a wide variety of medical services and top-notch facilities. Find all the information at this link.",
                "Definitely! You'll be impressed by the range of medical services and facilities we offer. Click this link to explore further.",
                "Absolutely! With a diverse selection of medical services and modern facilities, our hospital has it all. Learn more through this link.",
                "Of course! Click on this link to discover the abundance of medical services and facilities available at our hospital.",
                "Certainly! We offer an extensive range of medical services and state-of-the-art facilities. All the information can be found in this link.",
                "Sure thing! From a wide array of medical services to top-class facilities, you'll find it all at this link.",
                "Definitely! You'll be delighted to explore the numerous medical services and facilities we have. Access all the details through this link.",
                "Absolutely! Our hospital boasts an extensive range of medical services and cutting-edge facilities. Find all the details in this link.",
                "Of course! With a myriad of medical services and excellent facilities, you'll find everything you need by following this link.",
                "Certainly! Click on this link to discover the abundance of medical services and facilities available at our hospital.",
                "Sure thing! We take pride in offering an extensive range of medical services and modern facilities. Click here to learn more.",
                "Definitely! Our hospital provides a wide variety of medical services and top-notch facilities. Find all the information at this link.",
                "Absolutely! You'll be impressed by the range of medical services and facilities we offer. Click this link to explore further.",
                "Of course! With a diverse selection of medical services and modern facilities, our hospital has it all. Learn more through this link.",
                "Certainly! Click on this link to discover the abundance of medical services and facilities available at our hospital.",
                "Sure thing! We offer an extensive range of medical services and state-of-the-art facilities. All the information can be found in this link.",
                "Definitely! From a wide array of medical services to top-class facilities, you'll find it all at this link.",
                "Absolutely! You'll be delighted to explore the numerous medical services and facilities we have. Access all the details through this link.",
                "Of course! Our hospital boasts an extensive range of medical services and cutting-edge facilities. Find all the details in this link.",
                "Certainly! With a myriad of medical services and excellent facilities, you'll find everything you need by following this link.",
                "Sure thing! Click on this link to discover the abundance of medical services and facilities available at our hospital.",
                "Definitely! We take pride in offering an extensive range of medical services and modern facilities. Click here to learn more.",
                "Absolutely! Our hospital provides a wide variety of medical services and top-notch facilities. Find all the information at this link.",
                "Of course! You'll be impressed by the range of medical services and facilities we offer. Click this link to explore further.",
                "Certainly! With a diverse selection of medical services and modern facilities, our hospital has it all. Learn more through this link.",
                "Sure thing! Click on this link to discover the abundance of medical services and facilities available at our hospital.",
                "Definitely! We offer an extensive range of medical services and state-of-the-art facilities. All the information can be found in this link.",
                "Absolutely! From a wide array of medical services to top-class facilities, you'll find it all at this link.",
                "Of course! You'll be delighted to explore the numerous medical services and facilities we have. Access all the details through this link.",
                "Certainly! Our hospital boasts an extensive range of medical services and cutting-edge facilities. Find all the details in this link.",
                "Sure thing! With a myriad of medical services and excellent facilities, you'll find everything you need by following this link.",
                "Definitely! Click on this link to discover the abundance of medical services and facilities available at our hospital.",
                "Absolutely! We take pride in offering an extensive range of medical services and modern facilities. Click here to learn more.",
                "Of course! Our hospital provides a wide variety of medical services and top-notch facilities. Find all the information at this link.",
                "Certainly! You'll be impressed by the range of medical services and facilities we offer. Click this link to explore further.",
                "Sure thing! With a diverse selection of medical services and modern facilities, our hospital has it all. Learn more through this link.",
                "Definitely! Click on this link to discover the abundance of medical services and facilities available at our hospital."
            ]
        }
    ]
}