{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hello there!",
                "Hi!",
                "Hey!",
                "Good morning!",
                "Good afternoon!",
                "Good evening!",
                "Hi there, chatbot!",
                "Hey, how are you?",
                "Greetings, chatbot!",
                "What's up, bot?",
                "Hi, buddy!",
                "Hello, dear bot!",
                "Howdy, chatbot!",
                "Yo, bot!",
                "Hey, chat friend!",
                "Hi, virtual assistant!",
                "Hello, AI bot!",
                "Hi, there, clever bot!",
                "Greetings and salutations!",
                "Well, hello there!",
                "Hiya, chatbot!",
                "Good to see you, bot!",
                "Hey, robot friend!",
                "How's it going, chatbot?",
                "Hello, smart AI!",
                "Hi there, helpful bot!",
                "Hey, virtual friend!",
                "Hello, chat partner!",
                "How are you doing today?",
                "Hi, interactive assistant!",
                "Greetings, helpful bot!",
                "Hey, AI buddy!",
                "Hi there, digital companion!",
                "Hello, knowledgeable bot!",
                "Good morning, chatbot friend!",
                "Hey, smart bot, how can you assist me?",
                "Hi, bot, ready to chat?",
                "Hello, friendly AI!",
                "Hi there, chatbot expert!",
                "Hey, virtual buddy!",
                "Hello, clever chatbot!",
                "How's my favorite AI today?",
                "Hi there, amazing bot!",
                "Hey, chatbot, nice to see you!",
                "Hello, intelligent assistant!",
                "Hi, there, chatbot pal!",
                "Hey, helpful virtual friend!",
                "Greetings, virtual chat assistant!",
                "Well, hello, chatbot genius!",
                "Hi, talkative bot!"
            ],
            "responses": [
                "Hey there! I hope you have a great day ahead. How can I assist you? You can ask.\n",
                "Hello! Wishing you a wonderful day. How may I be of service? You can ask.\n",
                "Greetings! I hope your day is going well. How can I help you today? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. What can I do for you? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I be of assistance? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How may I assist you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How can I help you today? You can ask.\n",
                "Hey there! I hope you're having a great day. How may I be of service? You can ask.\n",
                "Hello! Wishing you a wonderful day ahead. What can I do for you? You can ask.\n",
                "Greetings! I hope your day is going well. How can I assist you today? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I help you today? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How may I assist you? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How can I be of assistance? You can ask.\n",
                "Hi! Wishing you a fantastic day. What can I do for you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. What can I do for you? You can ask.\n",
                "Hello! Wishing you a wonderful day. How can I assist you? You can ask.\n",
                "Greetings! I hope your day is going well. How may I help you? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How may I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I be of service? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. What can I do for you? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How can I assist you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How may I help you? You can ask.\n",
                "Hey there! I hope you're having a great day. What can I do for you? You can ask.\n",
                "Hello! Wishing you a wonderful day ahead. How can I be of assistance? You can ask.\n",
                "Greetings! I hope your day is going well. How can I help you today? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How may I assist you? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I help you today? You can ask.\n",
                "Greetings! I hope your day is filled with joy. What can I do for you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How can I assist you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. What can I do for you? You can ask.\n",
                "Hello! Wishing you a wonderful day. How may I be of service? You can ask.\n",
                "Greetings! I hope your day is going well. How can I assist you? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I be of service? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I help you today? You can ask.\n",
                "Greetings! I hope your day is filled with joy. How can I assist you? You can ask.\n",
                "Hi! Wishing you a fantastic day. What can I do for you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. How may I be of service? You can ask.\n",
                "Hello! Wishing you a wonderful day. How can I assist you? You can ask.\n",
                "Greetings! I hope your day is going well. What can I do for you? You can ask.\n",
                "Hi there! I hope you're having a fantastic day. How can I assist you? You can ask.\n",
                "Hey! I wish you a great day ahead. How can I help you today? You can ask.\n",
                "Hello there! Hoping your day is going splendidly. How can I assist you? You can ask.\n",
                "Greetings! I hope your day is filled with joy. What can I do for you? You can ask.\n",
                "Hi! Wishing you a fantastic day. How can I assist you? You can ask.\n",
                "Hey there! I hope you have a great day ahead. How can I be of service? You can ask.\n",
                "Hello! Wishing you a wonderful day. How can I assist you?"
            ]
        },
        {
            "tag": "book_session",
            "patterns": [
                "Book an apoointment",
                "I'd like to schedule a doctor's appointment",
                "Can I arrange a visit with a doctor",
                "I'm interested in booking a doctor's appointment",
                "Is it possible to set up a medical appointment",
                "Could you help me book a doctor's visit",
                "I need to schedule an appointment with a physician",
                "I'm looking to secure a time for a doctor's appointment",
                "Can you assist me in booking a doctor's consultation",
                "I want to reserve a spot for a doctor's appointment",
                "I'm seeking to arrange a doctor's appointment",
                "Could you help me plan a visit to the doctor",
                "I'd like to confirm an appointment with a doctor",
                "Can you guide me through booking a doctor's appointment",
                "I'm interested in locking in a doctor's appointment",
                "I want to select a time for a doctor's visit",
                "Is there a way to choose a doctor's appointment",
                "Can you assist me in booking a doctor's slot",
                "I'd like to mark a date for a doctor's appointment",
                "I need to confirm a doctor's visit",
                "I want to secure a time for a doctor's appointment",
                "Can you help me book a doctor's consultation",
                "I'm looking to fix an appointment with a doctor",
                "I'm interested in getting on the doctor's calendar",
                "I want to confirm my slot for a doctor's appointment",
                "Can I select a meeting time with a doctor",
                "Could you assist me in choosing a doctor's appointment",
                "I'd like to reserve a meeting with a doctor",
                "I'm seeking to request an appointment with a doctor",
                "I need to secure my time for a doctor's visit",
                "I want to book a consultation with a doctor",
                "Is it possible to lock my appointment with a doctor",
                "Can you help me plan my doctor's appointment",
                "I'm interested in setting up a meeting with a doctor",
                "I'd like to arrange my time for a doctor's visit",
                "I want to choose a consultation time with a doctor",
                "Could you assist me in confirming my appointment",
                "I'm looking to pick a slot for a doctor's appointment",
                "I need to select my preferred time for a doctor's visit",
                "I want to reserve my consultation with a doctor",
                "Is there a way to request my time for a doctor's appointment",
                "Can you help me secure my slot for a doctor's visit",
                "I'd like to book my consultation with a doctor",
                "I'm seeking to lock in my appointment with a doctor",
                "I want to plan my visit to the doctor",
                "Could you assist me in setting up my doctor's appointment",
                "I'm interested in arranging my time for a doctor's visit",
                "I need to choose a doctor's consultation",
                "I want to confirm my preferred time for a doctor's appointment",
                "Can you help me pick a slot for a doctor's visit",
                "I'd like to select my schedule for a doctor's appointment",
                "Could you help me schedule an appointment with one of your doctors?",
                "I'm interested in booking a session with one of your doctors, can you assist?",
                "Please, I need to make an appointment to see one of your doctors.",
                "I'd appreciate it if you could help me arrange a consultation with one of your doctors.",
                "I want to book an appointment with one of your doctors, can you guide me through the process?",
                "Can you assist me in scheduling a doctor's appointment at your facility?",
                "I'm looking to reserve a slot with one of your doctors, can you provide available dates?",
                "Could you please help me book a session with one of your doctors?",
                "I need your assistance in setting up an appointment with one of your doctors.",
                "Can you guide me on how to make an appointment with one of your doctors?",
                "I'd like to schedule a consultation with one of your doctors, can you help?",
                "Please assist me in reserving a session with one of your doctors.",
                "I'm hoping you can help me arrange a doctor's appointment at your hospital.",
                "Is it possible to book an appointment with one of your doctors? I'd appreciate your help.",
                "I'm interested in seeing one of your doctors, can you provide me with the next available slot?",
                "Could you please arrange a consultation with one of your doctors for me?",
                "I'd like to make an appointment with a doctor from your medical team.",
                "Can you help me schedule a session with one of your doctors, please?",
                "I need to set up a meeting with one of your doctors. Can you assist me?",
                "I'm looking to book a session with one of your doctors, can you tell me how to proceed?",
                "Please, I need to make an appointment with one of your doctors as soon as possible.",
                "Could you assist me in reserving a slot with one of your doctors?",
                "I want to book a consultation with one of your doctors, please guide me.",
                "Is it possible to schedule a doctor's appointment at your hospital?",
                "I'm interested in arranging a consultation with one of your doctors, can you help?"
            ],
            "responses": [
                "I'm here to help. Could you kindly describe the symptoms you're currently facing?",
                "Sure thing! Please let me know what symptoms you're experiencing so I can better understand and assist you.",
                "No problem at all. Can you share the symptoms you're dealing with so I can offer appropriate support?",
                "I'm ready to assist. Please provide details about the symptoms you're going through.",
                "Of course, I'm here to listen. What symptoms have you been experiencing lately?",
                "I'm here to help with your symptoms. Could you let me know what you're going through?",
                "Sure, I'm all ears. Tell me about the symptoms you're currently encountering.",
                "I'm here to support you. Please share the symptoms you've been dealing with.",
                "I'm here to assist with your health concerns. What symptoms are you experiencing?",
                "No worries, I'm here to listen. What symptoms would you like to discuss?",
                "I'm ready to help. Please tell me about the symptoms you're facing.",
                "Of course, I'm here to assist you. What symptoms are you currently dealing with?",
                "Sure, I'm here to lend a hand. Could you describe the symptoms you've been having?",
                "I'm here to assist with any health issues you may have. What symptoms are troubling you?",
                "No problem, I'm here to help. Can you let me know what symptoms you're experiencing?",
                "I'm ready to listen and offer support. Please describe the symptoms you're going through.",
                "Of course, I'm here to assist you with your symptoms. What are they?",
                "Sure thing! Please share the symptoms you've been experiencing so I can better understand.",
                "I'm here to support you. Can you tell me about the symptoms you're currently facing?",
                "I'm all ears. What symptoms are you dealing with that I can help you with?",
                "No worries, I'm here to assist. What symptoms have you been experiencing lately?",
                "I'm here to help with your symptoms. Let me know what you're going through.",
                "I'm here to listen and provide guidance. Please share the symptoms you've been having.",
                "Sure, I'm here to lend a hand. What symptoms are troubling you that you'd like to discuss?",
                "I'm here to assist with any health concerns. Could you describe the symptoms you're facing?",
                "No problem, I'm here to help. What symptoms would you like to talk about?",
                "I'm ready to help. Please let me know about the symptoms you're dealing with.",
                "Of course, I'm here to assist you. Can you tell me about the symptoms you're experiencing?",
                "Sure, I'm here to listen and offer support. Please describe your symptoms.",
                "I'm here to support you. What symptoms have you been experiencing that I should know about?",
                "I'm here to help. Could you kindly share the symptoms you're currently experiencing?",
                "Of course, I'm here to assist you. Please let me know what symptoms you're going through.",
                "No problem at all. Can you describe the symptoms you're dealing with so I can offer help?",
                "I'm ready to assist. Please provide details about the symptoms you're facing.",
                "Of course, I'm here to listen. What symptoms are you currently encountering?",
                "Sure, I'm all ears. Tell me about the symptoms you're currently dealing with.",
                "I'm here to assist with your health concerns. What symptoms are you experiencing?",
                "No worries, I'm here to listen. What symptoms would you like to discuss?",
                "I'm ready to help. Please tell me about the symptoms you're facing.",
                "Of course, I'm here to assist with your symptoms. What are they?",
                "Sure thing! Please share the symptoms you've been experiencing so I can better understand.",
                "I'm here to support you. Can you tell me about the symptoms you're currently facing?",
                "I'm all ears. What symptoms are you dealing with that I can help you with?",
                "No worries, I'm here to assist. What symptoms have you been experiencing lately?",
                "I'm here to help with your symptoms. Let me know what you're going through.",
                "I'm here to listen and provide guidance. Please share the symptoms you've been having.",
                "Sure, I'm here to lend a hand. What symptoms are troubling you that you'd like to discuss?",
                "I'm here to assist with any health concerns. Could you describe the symptoms you're facing?",
                "No problem, I'm here to help. What symptoms would you like to talk about?",
                "I'm ready to help. Please let me know about the symptoms you're dealing with."
            ]
        },
        {
            "tag": "session_cancelation",
            "patterns": [
                "Can you please cancel my appointment?",
                "I'd like to cancel my appointment.",
                "Could you cancel my appointment, please?",
                "I want to cancel my appointment.",
                "Is it possible to cancel my appointment?",
                "Can you assist me in canceling my appointment?",
                "I need to cancel my appointment.",
                "Would you be able to cancel my appointment?",
                "Can you help me cancel my appointment?",
                "I'm looking to cancel my appointment.",
                "Could you please help me cancel my appointment?",
                "I'd appreciate if you could cancel my appointment.",
                "Is there a way to cancel my appointment?",
                "Can you please cancel my scheduled appointment?",
                "I want to cancel my previously arranged appointment.",
                "Could you assist me with canceling my appointment?",
                "I need to cancel my appointment, if you can.",
                "Can you help me by canceling my appointment?",
                "I'm interested in canceling my appointment.",
                "Could you cancel my appointment, if possible?",
                "I'd like to cancel my appointment, if you don't mind.",
                "Can you cancel my appointment for me?",
                "I want to cancel my appointment slot.",
                "Could you please assist me in canceling my appointment?",
                "I need to cancel my appointment, if it's convenient.",
                "Can you help me out by canceling my appointment?",
                "I'm hoping you can cancel my appointment.",
                "Could you cancel my appointment when you have time?",
                "I want to cancel my appointment with you.",
                "Can you assist me in canceling my appointment, please?",
                "I need to cancel my appointment as soon as possible.",
                "Could you cancel my appointment, if that's okay?",
                "Can you please cancel my appointment, if you're able to?",
                "I want to cancel my appointment, when it's suitable.",
                "Could you assist me with canceling my appointment, when you're ready?",
                "I need to cancel my appointment, when it's comfortable for you.",
                "Can you help me by canceling my appointment, if you're in a position to?",
                "I want to cancel my appointment, if you're prepared.",
                "Could you please cancel my appointment, if you can?",
                "I need to cancel my appointment, when you're available.",
                "Can you assist me in canceling my appointment, when you're free?",
                "I want to cancel my appointment, if that's possible.",
                "Could you cancel my appointment, when it's suitable for you?",
                "I need to cancel my appointment, when you're ready.",
                "Can you help me by canceling my appointment, if you're comfortable?",
                "I'm hoping you can cancel my appointment, when you're able to.",
                "Could you cancel my appointment, when you're in a position to?",
                "I want to cancel my appointment, when you're prepared.",
                "Can you assist me in canceling my appointment, when you're available?",
                "I need to cancel my appointment, when you're free.",
                "I need to cancel the appointment I scheduled at your hospital.",
                "Can you help me cancel the appointment I made at your hospital?",
                "I've decided to cancel my appointment at your hospital.",
                "I'd like to cancel the appointment I had previously booked at your hospital.",
                "Could you assist me in canceling my appointment at your hospital?",
                "I want to cancel the appointment I had arranged at your hospital.",
                "Please cancel the appointment I made at your hospital.",
                "I've changed my plans and need to cancel my appointment at your hospital.",
                "Can you cancel the appointment I had reserved at your hospital?",
                "I need to reschedule my appointment at your hospital. Can we cancel the current one?",
                "Please mark my appointment as canceled at your hospital.",
                "I'm no longer able to make it to the appointment at your hospital. Can we cancel it?",
                "I'd like to revoke the appointment I scheduled at your hospital.",
                "Could you cancel the appointment I had fixed at your hospital?",
                "Please cancel my appointment at your hospital. I won't be able to make it.",
                "I want to cancel my previously arranged appointment at your hospital.",
                "I need to cancel the appointment I had confirmed at your hospital.",
                "Can you cancel the appointment I made for [date/time] at your hospital?",
                "Please cancel my appointment at your hospital due to unforeseen circumstances.",
                "I'm afraid I won't be able to make it to my appointment at your hospital. Can we cancel it?",
                "I'd like to cancel the appointment I had scheduled with [doctor's name] at your hospital.",
                "Please cancel my appointment at your hospital as my plans have changed.",
                "I need to cancel my upcoming appointment at your hospital.",
                "Could you please assist me in canceling my appointment at your hospital?",
                "I want to cancel the appointment I made for [date/time] at your hospital.",
                "Please cancel the appointment I booked at your hospital. Something came up.",
                "I'd like to cancel my appointment at your hospital and reschedule it for another time."
            ],
            "responses": [
                "I need the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please provide me with the session ID you got during the session booking process.",
                "I'd like to have the session ID that was provided to you when you booked your session.",
                "Can you give me the session ID you received after scheduling your session?",
                "I require the session ID you obtained at the time of booking your session.",
                "Could you kindly share the session ID you got while booking your session?",
                "Please share the session ID that was given to you when you scheduled your session.",
                "I'm looking for the session ID you received after booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "I need the session ID you received when you scheduled your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session."
            ]
        },
        {
            "tag": "session_reschedule",
            "patterns": [
                "Can I change the time of my last appointment?",
                "I'd like to reschedule my last appointment.",
                "Could you help me move my last appointment to a different time?",
                "I need to reschedule my last appointment.",
                "Is it possible to shift my last appointment to another time?",
                "Can you assist me in changing the time of my last appointment?",
                "I want to reschedule my last appointment that was previously scheduled.",
                "Could you please help me reschedule my last appointment?",
                "I'm interested in moving my last appointment to a new time.",
                "Is it okay to change the time of my last appointment?",
                "I'd like to reschedule my appointment to a different time.",
                "Can you help me with changing the time of my last appointment?",
                "I need to move my last appointment to another time.",
                "Could you help me reschedule my last appointment?",
                "I want to change the time of my last appointment.",
                "Can I shift the time of my last appointment to another slot?",
                "I'm interested in moving my last appointment to a different time.",
                "Could you assist me in rescheduling my last appointment?",
                "I need to reschedule my last appointment that was previously set.",
                "Is it possible to change the time of my last appointment?",
                "I'd like to reschedule my last scheduled appointment.",
                "Can you help me move my appointment to another time?",
                "I want to reschedule my last appointment slot.",
                "Could you please assist me in changing the time of my last appointment?",
                "I'm looking to shift my last appointment to a new time.",
                "Is it okay if I change the time of my last appointment?",
                "I need to reschedule the appointment I scheduled at your hospital.",
                "Can you help me reschedule the appointment I made at your hospital?",
                "Can I change the time of my appointment?",
                "I'd like to reschedule my appointment.",
                "Could you help me move my appointment to a different time?",
                "I need to reschedule my appointment.",
                "Is it possible to shift my appointment to another time?",
                "Can you assist me in changing the time of my appointment?",
                "I want to reschedule my appointment that was previously scheduled.",
                "Could you please help me reschedule my appointment?",
                "I'm interested in moving my appointment to a new time.",
                "Is it okay to change the time of my appointment?",
                "I'd like to reschedule my appointment to a different time.",
                "Can you help me with changing the time of my appointment?",
                "I need to move my appointment to another time.",
                "Could you help me reschedule my appointment?",
                "I want to change the time of my appointment.",
                "Can I shift the time of my appointment to another slot?",
                "I'm interested in moving my appointment to a different time.",
                "Could you assist me in rescheduling my appointment?",
                "I need to reschedule my appointment that was previously set.",
                "Is it possible to change the time of my appointment?",
                "I'd like to reschedule my scheduled appointment.",
                "Can you help me move my appointment to another time?",
                "I want to reschedule my appointment slot.",
                "Could you please assist me in changing the time of my appointment?",
                "I'm looking to shift my appointment to a new time.",
                "Is it okay if I change the time of my appointment?",
                "I've decided to change the date of my appointment at your hospital.",
                "I'd like to reschedule the appointment I had previously booked at your hospital.",
                "Could you assist me in rescheduling my appointment at your hospital?",
                "I want to change the date of the appointment I had arranged at your hospital.",
                "Please reschedule the appointment I made at your hospital.",
                "I've changed my plans and need to reschedule my appointment at your hospital.",
                "Can you reschedule the appointment I had reserved at your hospital?",
                "I need to find a new date for my appointment at your hospital. Can we reschedule it?",
                "Please mark my appointment as rescheduled at your hospital.",
                "I'm no longer able to make it to the appointment at your hospital. Can we reschedule it?",
                "I'd like to reschedule the appointment I scheduled at your hospital.",
                "Could you reschedule the appointment I had fixed at your hospital?",
                "Please reschedule my appointment at your hospital. I won't be able to make it.",
                "I want to change the date of my previously arranged appointment at your hospital.",
                "I need to reschedule the appointment I had confirmed at your hospital.",
                "Can you reschedule the appointment I made at your hospital?",
                "Please reschedule my appointment at your hospital due to unforeseen circumstances.",
                "I'm afraid I won't be able to make it to my appointment at your hospital. Can we reschedule it?",
                "I'd like to reschedule the appointment I had scheduled at your hospital.",
                "Please reschedule my appointment at your hospital as my plans have changed.",
                "I need to reschedule my upcoming appointment at your hospital.",
                "Could you please assist me in rescheduling my appointment at your hospital?",
                "I want to change the date of the appointment I made at your hospital.",
                "Please reschedule the appointment I booked at your hospital. Something came up."
            ],
            "responses": [
                "I need the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please provide me with the session ID you got during the session booking process.",
                "I'd like to have the session ID that was provided to you when you booked your session.",
                "Can you give me the session ID you received after scheduling your session?",
                "I require the session ID you obtained at the time of booking your session.",
                "Could you kindly share the session ID you got while booking your session?",
                "Please share the session ID that was given to you when you scheduled your session.",
                "I'm looking for the session ID you received after booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "I need the session ID you received when you scheduled your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session.",
                "I require the session ID you obtained at the time of booking your session.",
                "Can you give me the session ID you received when you booked your session?",
                "I'd like to have the session ID that was provided to you when you scheduled your session.",
                "Please provide me with the session ID you got while booking your session.",
                "I'm curious about the session ID you received after booking your session.",
                "Could you share the session ID that was given to you when you booked your session?",
                "Please share the session ID you got at the time of booking your session.",
                "Can you please pass along the session ID you obtained during the session booking?",
                "I'd appreciate it if you could provide me with the session ID you received after scheduling your session.",
                "Could you pass me the session ID that was provided to you when you booked your session?",
                "Please share the session ID you received when you scheduled your session.",
                "I need the session ID you received after booking your session.",
                "Can you provide me with the session ID you obtained after booking your session?",
                "I'm looking for the session ID that was given to you when you booked your session.",
                "Could you kindly share the session ID you got during the session booking process?",
                "Please pass along the session ID you received after scheduling your session."
            ]
        },
        {
            "tag": "feedback",
            "patterns": [
                "I was hoping to give some feedback.",
                "Can I provide some feedback?",
                "I had some feedback to share.",
                "Could I share my feedback?",
                "I wanted to give my thoughts.",
                "Can I offer some feedback?",
                "I had feedback I wanted to share.",
                "I was looking to provide feedback.",
                "Could I share my thoughts?",
                "I wanted to offer some feedback.",
                "I was hoping to share my thoughts.",
                "Can I give some feedback?",
                "I had some thoughts to share.",
                "I was looking to offer feedback.",
                "I wanted to provide some feedback.",
                "Can I share some feedback?",
                "I had some feedback to give.",
                "Could I offer my feedback?",
                "I was hoping to provide some thoughts.",
                "Can I offer my thoughts?",
                "I wanted to give some thoughts.",
                "I was looking to share my feedback.",
                "Can I provide some thoughts?",
                "I had thoughts I wanted to share.",
                "I wanted to share my feedback with you.",
                "I was hoping to offer feedback.",
                "Can I give my thoughts?",
                "I had feedback to offer.",
                "I wanted to provide my feedback.",
                "I was looking to give feedback.",
                "Can I share my thoughts?",
                "I had thoughts to share.",
                "I wanted to give some feedback on this.",
                "I was hoping to share feedback with you.",
                "Can I provide feedback?",
                "I had some feedback to provide.",
                "I wanted to offer feedback on this.",
                "I was looking to give some thoughts on this.",
                "Can I offer some thoughts?",
                "I wanted to provide thoughts.",
                "I was hoping to share some feedback.",
                "Can I provide my thoughts?",
                "I wanted to give feedback on this.",
                "I was looking to provide feedback on this.",
                "Can I share feedback?",
                "I wanted to offer some thoughts.",
                "I was hoping to provide feedback on this.",
                "Can I give feedback?",
                "I wanted to share my thoughts on this.",
                "I was looking to offer some feedback on this.",
                "Can I provide some feedback on this?",
                "I wanted to give some feedback about this.",
                "I wanted to share my feedback about my recent hospital visit.",
                "I have some feedback to share from my recent experience at your hospital.",
                "I'd like to give feedback about the care I received during my hospital visit.",
                "Is there a way for me to submit feedback regarding my recent hospital visit?",
                "I'm interested in providing feedback about my recent visit to your hospital.",
                "Can I share my thoughts and feedback on my recent hospital visit with you?",
                "I'd appreciate the opportunity to give feedback about my recent hospital experience.",
                "How can I offer feedback about my recent visit to your hospital?",
                "I'd like to express my feedback regarding the service I received at your hospital.",
                "Is there a feedback form or process for my recent hospital visit?",
                "I want to provide feedback about the quality of care during my recent hospital visit.",
                "Could you guide me on how to give feedback about my recent hospital visit?",
                "I have some feedback about my recent visit to your hospital that I'd like to share.",
                "Can you direct me to the feedback system for my recent hospital visit?",
                "I'd like to share my feedback about the medical staff during my recent hospital visit.",
                "I want to provide feedback on the facilities and services at your hospital.",
                "Is there a specific way to provide feedback about my recent hospital stay?",
                "I'd appreciate the chance to give feedback on my recent experience at your hospital.",
                "How can I share my feedback about the hospital's amenities and accommodations?",
                "I'd like to offer feedback about the overall patient experience during my hospital visit.",
                "Could you tell me how to submit feedback about my recent hospital visit?",
                "I want to provide feedback about the cleanliness and hygiene at your hospital.",
                "Is there a platform or email where I can send my feedback regarding my hospital visit?"
            ],
            "responses": [
                "Absolutely! Your feedback holds immense value to us in our quest to improve our services every day. Please feel free to share your valuable feedback below.",
                "We genuinely appreciate your feedback, as it plays a crucial role in enhancing our services. Kindly take a moment to share your valuable feedback with us below.",
                "Thank you for considering sharing your feedback! Your insights are invaluable, and we're eager to hear your thoughts. Please type your valuable feedback below.",
                "Your feedback means a lot to us! It's an essential part of our continuous improvement journey. Please share your valuable feedback below.",
                "We highly value your feedback! It guides us in delivering the best possible care. Please take a moment to type your feedback below.",
                "We're grateful for your feedback as it empowers us to grow and serve you better. Kindly type your feedback in the box below.",
                "Your feedback is like a compass, directing us toward excellence. We're eager to hear from you. Please share your feedback below.",
                "We're committed to your satisfaction, and your feedback drives us in that direction. Please share your valuable feedback below.",
                "Your feedback is a precious gift that helps us excel. Thank you for taking the time to share your thoughts. Please type your feedback below.",
                "Your feedback is a cornerstone in shaping our services. We appreciate your valuable input. Please share your feedback below.",
                "We're here to listen! Your feedback is an integral part of our growth. Please take a moment to share your valuable feedback below.",
                "Your feedback is a driving force behind our progress. We're excited to hear what you have to say. Please type your feedback below.",
                "We treasure your feedback! It enables us to evolve and provide top-notch services. Kindly type your feedback in the box below.",
                "Your feedback is gold to us! We appreciate your valuable insights in making us better. Please type your feedback below.",
                "We believe in the power of your feedback! It shapes our journey towards excellence. Kindly share your valuable feedback in the box below.",
                "Your feedback is instrumental in our pursuit of perfection. We're all ears to your valuable thoughts. Please type your feedback below.",
                "We're grateful for your feedback, as it shapes our efforts to deliver exceptional care. Please share your feedback below.",
                "Your feedback is a critical piece of our puzzle, helping us achieve excellence. Kindly share your valuable feedback in the box below.",
                "We value your feedback as it propels us forward in our mission to provide the best care possible. Please type your feedback below.",
                "Your feedback is the foundation of our success. We're eager to hear your valuable insights. Please share your feedback below.",
                "Thank you for being an essential part of our improvement process! Your feedback is invaluable. Please share your valuable feedback below.",
                "We're all ears to hear about your recent experience! Your feedback guides us on the path of continuous improvement. Please type your feedback below.",
                "Your feedback is a guiding light that illuminates our way to excellence. We eagerly await your valuable thoughts. Please share your feedback below.",
                "We greatly value your feedback! It fuels our commitment to deliver outstanding services. Please take a moment to type your feedback below.",
                "Your feedback is like a compass, steering us toward perfection. We're eager to hear your valuable insights. Please type your feedback below.",
                "We're dedicated to making your experience better, and your feedback paves the way. Please share your valuable feedback below.",
                "Your feedback is a powerful tool that drives our continuous growth. We're all ears to hear what you have to say. Please type your feedback below.",
                "Thank you for choosing to share your feedback! Your thoughts are crucial in helping us improve our services. Please share your valuable feedback below.",
                "Your feedback is the fuel that propels our journey of improvement. We look forward to hearing your valuable insights. Please type your feedback below.",
                "We're on a mission to exceed your expectations, and your feedback is key. Please share your valuable feedback below.",
                "Your feedback is the key to unlock our potential. We're eager to know how we can serve you better. Please type your feedback below.",
                "Thank you for being a part of our improvement process! Your feedback drives us to excel. Please share your valuable feedback below.",
                "Your feedback serves as a compass, guiding us to elevate our services. We're all ears to hear your valuable thoughts. Please type your feedback below.",
                "We genuinely appreciate your feedback as it motivates us to provide exceptional care. Kindly take a moment to share your valuable feedback with us below.",
                "Your feedback fuels our passion to deliver top-notch services. We're eager to hear your thoughts. Please share your feedback below.",
                "Thank you for considering to provide your feedback! It plays a vital role in shaping our services. Please type your feedback below.",
                "Your feedback is our compass, pointing us toward continuous improvement. We're eager to hear from you. Please share your feedback below.",
                "We're committed to listening and learning from your feedback. It inspires us to strive for excellence. Please type your feedback below.",
                "Your feedback is the heartbeat of our growth. We're all ears to hear your valuable insights. Please share your feedback below.",
                "We're driven by your feedback! It helps us evolve and provide exceptional care. Kindly type your feedback in the box below.",
                "Your feedback is our north star, guiding us toward betterment. We value your thoughts. Please share your feedback below.",
                "Thank you for sharing your feedback! It's a vital ingredient in our recipe for improvement. Please type your valuable feedback below.",
                "Your feedback is the wind beneath our wings, propelling us to soar higher. We eagerly await your valuable thoughts. Please share your feedback below.",
                "We're all ears to hear your feedback! It empowers us to make positive changes. Please take a moment to type your feedback below.",
                "Your feedback is a beacon of inspiration, illuminating our path to excellence. Please share your valuable feedback below.",
                "We're grateful for your feedback, as it shapes our efforts to deliver exceptional care. Please share your feedback below.",
                "Your feedback is a critical piece of our puzzle, helping us achieve excellence. Kindly share your valuable feedback in the box below.",
                "We value your feedback as it propels us forward in our mission to provide the best care possible. Please type your feedback below.",
                "Your feedback is the foundation of our success. We're eager to hear your valuable insights. Please share your feedback below.",
                "Thank you for considering sharing your feedback with us! Your thoughts drive our continuous improvement. Please type your feedback below."
            ]
        },
        {
            "tag": "service_completion",
            "patterns": [
                "No, that's it",
                "No, that's all",
                "No, I'm done",
                "No, I'm good",
                "No, I'm finished",
                "No, that's fine",
                "No, that's enough",
                "No, I'm satisfied",
                "No, all set",
                "No, that's all for now",
                "No, that's all I need",
                "No, that's sufficient",
                "No, I'm content",
                "No, that's complete",
                "No, I'm okay",
                "No, no more",
                "No, I'm happy",
                "No, that's final",
                "No, that's all done",
                "No, I'm all set",
                "No, that's all for this",
                "No, I'm done here",
                "No, that's all for today",
                "No, that's the end",
                "No, that's all I want",
                "No, I'm good now",
                "No, that's the whole thing",
                "No, that's everything",
                "No, that's all I have",
                "No, that's the whole deal",
                "No, that's all for this task",
                "No, I'm finished here",
                "No, that's all I'm after",
                "No, I'm content with that",
                "No, that's all for this service",
                "No, that's all I'm looking for",
                "No, that's all for this request",
                "No, that's all I'm expecting",
                "No, I'm satisfied with that",
                "No, that's all for this matter",
                "No, that's the extent of it",
                "No, that's all I require",
                "No, I'm content with this",
                "No, that's all for this job",
                "No, that's all I'm aiming for",
                "No, I'm happy with that",
                "No, that's all for this issue",
                "No, that's everything I need",
                "No, I'm good with that",
                "No, that's all for this query",
                "No, that's all for this concern",
                "No, I'm done with this",
                "No, that's the limit",
                "No, that's all for now with this",
                "No",
                "nope",
                "nothing elese",
                "that's it",
                "no, that's all",
                "no, nothing else",
                "that's all",
                "thank you that's all",
                "that's enough for now",
                "That covers everything I needed, thank you.",
                "I don't need anything else, thank you.",
                "I'm good with the information provided.",
                "I have no further requests, thank you.",
                "That's all for now, thanks.",
                "I'm satisfied with the assistance.",
                "I don't require any more help, thanks.",
                "That's all I was looking for.",
                "No, I have no further inquiries.",
                "No, that's sufficient for now.",
                "No, I don't require any more assistance.",
                "No, that's the conclusion of our discussion.",
                "No, that's everything I was looking for.",
                "No, I don't have any other queries.",
                "No, that's all I wanted to discuss.",
                "No, I'm done with my requests.",
                "No, that's all I needed help with.",
                "No, that completes our conversation.",
                "No, I have no more issues to address.",
                "No, I'm happy with the information provided.",
                "No, I don't need any further explanations.",
                "No, that's the end of my inquiries.",
                "No, I don't have any additional questions.",
                "No, that's all for this interaction."
            ],
            "responses": [
                "I'm glad I could assist you. If you require anything in the future, don't hesitate to ask or contact our hospital helpline for further support.",
                "It was my pleasure to help you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm happy I could be of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm delighted to have assisted you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm pleased that I could help. If you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm grateful for the opportunity to assist you. Should you need anything else in the future, don't hesitate to reach out to me or the hospital helpline for further assistance.",
                "I'm honored to have been of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm thankful for the chance to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm elated I could be of service. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm overjoyed that I could assist you. Should you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm pleased I could be of assistance. If you require anything else in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you need anything else in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm delighted I could assist you. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further guidance.",
                "I'm glad to have been of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm grateful I could help. If you have any more questions in the future, don't hesitate to reach out to me or the hospital helpline for further information.",
                "I'm honored to have had the opportunity to assist you. Should you need anything else in the future, don't hesitate to ask or contact the hospital helpline for further assistance.",
                "I'm thankful for the chance to be of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm elated to have been able to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm pleased I could be of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm overjoyed that I could assist you. Should you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm glad I could be of assistance. If you require anything else in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you need anything else in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm delighted I could assist you. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further guidance.",
                "I'm pleased to have been of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm grateful I could help. If you have any more questions in the future, don't hesitate to reach out to me or the hospital helpline for further information.",
                "I'm honored to have had the opportunity to assist you. Should you need anything else in the future, don't hesitate to ask or contact the hospital helpline for further assistance.",
                "I'm thankful for the chance to be of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm elated to have been able to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm pleased I could be of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm overjoyed that I could assist you. Should you have any more questions in the future, don't hesitate to ask or contact the hospital helpline for further information.",
                "I'm glad I could be of assistance. If you require anything else in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you need anything else in the future, feel free to reach out to me or the hospital helpline for further assistance.",
                "I'm delighted I could assist you. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further guidance.",
                "I'm pleased to have been of service. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional support.",
                "I'm grateful I could help. If you have any more questions in the future, don't hesitate to reach out to me or the hospital helpline for further information.",
                "I'm honored to have had the opportunity to assist you. Should you need anything else in the future, don't hesitate to ask or contact the hospital helpline for further assistance.",
                "I'm thankful for the chance to be of service. If there's anything else you need in the future, feel free to ask or contact the hospital helpline for further support.",
                "I'm elated to have been able to help you. Should you have any more inquiries in the future, don't hesitate to ask or contact the hospital helpline for additional assistance.",
                "I'm pleased I could be of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm glad I could assist you. If you require any more help in the future, don't hesitate to ask me or contact the hospital helpline for further guidance.",
                "It was my pleasure to be of service. If you need anything else in the future, feel free to reach out to me or the hospital helpline for additional support.",
                "I'm happy to have helped you. Should you have any more inquiries in the future, don't hesitate to ask me or the hospital helpline for further assistance.",
                "I'm delighted to have been of service to you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for further guidance.",
                "I'm honored that I could assist you. If you have any more questions in the future, don't hesitate to ask me or the hospital helpline for further information.",
                "I'm thankful for the opportunity to be of service. Should you need anything else in the future, don't hesitate to ask me or the hospital helpline for further support.",
                "I'm glad I could be of help. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for additional guidance.",
                "I'm pleased to have provided assistance. Should you have any more inquiries in the future, don't hesitate to ask me or the hospital helpline for further assistance.",
                "I'm happy that I could be of service. If you require any more help in the future, don't hesitate to ask me or the hospital helpline for further support.",
                "I'm delighted to have been able to assist you. Should you have any more questions in the future, don't hesitate to ask me or the hospital helpline for further information.",
                "I'm honored to have helped you. If there's anything else you need in the future, feel free to reach out to me or the hospital helpline for additional guidance."
            ]
        },
        {
            "tag": "fallback",
            "patterns": [
                "",
                " ",
                "blah blah blah",
                "???",
                "I'm confused.",
                "What's happening?",
                "I don't get it.",
                "This is unclear.",
                "I'm lost.",
                "Can you explain?",
                "I'm stuck.",
                "Please help.",
                "Try again?",
                "I'm uncertain.",
                "Need assistance.",
                "What now?",
                "I'm puzzled.",
                "Not sure.",
                "Confused here.",
                "Can you guide?",
                "I'm unsure.",
                "Lost track.",
                "Can you clarify?",
                "Feeling stuck.",
                "What's next?",
                "Need direction.",
                "Lost here.",
                "Help please.",
                "I'm at a loss.",
                "Can you assist?",
                "I'm at a dead end.",
                "Lost in this.",
                "This is unclear.",
                "I'm struggling.",
                "Not making sense.",
                "I'm baffled.",
                "What's the answer?",
                "Can you elaborate?",
                "I'm hitting a wall.",
                "I'm feeling lost.",
                "Need more info.",
                "This is confusing.",
                "I'm not following.",
                "I'm feeling uncertain.",
                "Can you simplify?",
                "I'm feeling overwhelmed.",
                "Please explain.",
                "I'm not sure.",
                "This is unclear to me.",
                "I'm feeling confused.",
                "Need more clarity.",
                "Can you help?",
                "I'm having trouble.",
                "I'm not grasping it.",
                "Please guide me.",
                "I'm having difficulties.",
                "Can you shed light?",
                "How tall is the Eiffel Tower? Just testing your general knowledge.",
                "Can you tell me a bedtime story? I know it's a bit childish, but why not?",
                "What's the square root of 576? I need some math help here.",
                "What's the formula for calculating velocity? Oh, I see, you're not a physics expert.",
                "What's the airspeed velocity of an unladen swallow? An old-school Monty Python reference!",
                "Where is Atlantis located? I know it's a myth, but let's play along.",
                "Tell me about the secret of the Bermuda Triangle. I'm into mysterious stuff.",
                "How do I time travel? Just wondering if you have any sci-fi tips.",
                "What's the recipe for a magic potion? Maybe you can create some digital magic.",
                "What's the cure for a broken heart? A chatbot's response might not be enough.",
                "Can you recommend a good movie to watch? I'm in the mood for something entertaining.",
                "Who won the World Series in 1953? Let's see if you have historical sports knowledge.",
                "What's the best way to win the lottery? I know it's a long shot, but any tips?",
                "Can you teach me how to fly? I'm just kidding, of course.",
                "I'm lost, can you help me find my way home? I hope you have a digital GPS.",
                "What's the meaning of the universe? I know, I know, it's a big question.",
                "Can you help me with my love life? I doubt AI can solve relationship problems.",
                "What's the best way to make money quickly? Asking for a friend, you know.",
                "I need advice on how to become a millionaire. It's a dream, I guess.",
                "What's the secret to eternal youth? Just curious if you have any age-defying secrets.",
                "What's the best diet for losing weight? A chatbot nutritionist might be helpful!",
                "Can you tell me a secret? A chatbot with secrets, intriguing.",
                "How do I become invisible? Just testing your superpower knowledge.",
                "Can you predict my future? You know, like a digital fortune teller.",
                "What's the meaning of this dream I had last night? I know, it's a bit personal.",
                "Can you tell me about the meaning of life according to some famous philosopher?",
                "Can you recite the first 100 digits of pi? I know it's a random challenge."
            ],
            "responses": [
                "I'm sorry, but I'm having trouble understanding your message. As a healthcare chatbot, feel free to explore any health-related questions below.",
                "Apologies, I'm having difficulty comprehending your input. You can inquire about medical topics from the options provided.",
                "I apologize, I can't seem to grasp what you're saying. You have the freedom to ask anything related to healthcare from the list below.",
                "I'm sorry, but your message is unclear to me. If you have any health-related inquiries, you can explore the options provided.",
                "Apologies for any confusion. As a healthcare chatbot, I'm here to help with any medical queries mentioned below.",
                "I'm afraid I can't understand your question. Feel free to explore health-related matters using the options below.",
                "Sorry, I can't comprehend your message at the moment. Please find health-related topics to inquire about below.",
                "I apologize, but I'm unable to interpret your query. You can explore health-related subjects from the provided options.",
                "I'm sorry, your message is not clear to me. You can inquire about various healthcare topics mentioned below.",
                "Apologies, I couldn't understand your input. Please explore various healthcare categories from the options mentioned below.",
                "I'm sorry, but I can't process your message. You can discover health-related information from the topics mentioned below.",
                "I apologize for any confusion. You can ask me about various healthcare topics available below.",
                "I'm afraid I can't comprehend your question. Feel free to explore health-related subjects listed below.",
                "Sorry, I can't seem to grasp what you're saying. Please find health-related categories mentioned below.",
                "I apologize, but your message is unclear to me. You can find information on different medical topics below.",
                "I'm sorry, but I'm having trouble understanding your query. Please find various medical topics below.",
                "I apologize, I can't understand your question. You have the freedom to inquire about healthcare matters below.",
                "I'm afraid I can't comprehend your message at the moment. If you have any health-related inquiries, find the topics below.",
                "Sorry, I can't process your message properly. Feel free to explore health-related subjects from the provided list.",
                "I apologize, I'm unable to interpret your query. You can explore health-related topics from the options provided.",
                "I'm sorry, your message is not clear to me. You can discover health-related information from the listed categories.",
                "Apologies, I couldn't understand your input. Please explore various health-related subjects mentioned below.",
                "I'm sorry, but I can't process your message. You can find information on different medical areas below.",
                "I apologize for any confusion. You can ask me about various medical topics available in the options below.",
                "I'm afraid I can't comprehend your question. Feel free to explore health-related inquiries listed below."
            ]
        }
    ]
}